[
  {
    "id": "task-001",
    "title": "Create shared event bus utility",
    "description": "Create src/lib/eventBus.ts — a typed publish/subscribe event bus for cross-module communication. Use TypeScript generics to type event payloads. Events include order_created, order_updated, inventory_changed, customer_updated, product_updated, storefront_synced, menu_published, notification_sent. Export subscribe, publish, unsubscribe functions. Use Map<string, Set<callback>> internally. Add logger.debug for every publish call. Do NOT use console.log.",
    "passes": true
  },
  {
    "id": "task-002",
    "title": "Create useEventBus hook",
    "description": "Create src/hooks/useEventBus.ts — a React hook wrapper around the eventBus utility. Auto-unsubscribe on component unmount using useEffect cleanup. Accept event name and callback. Return publish function for that event type. Type-safe with FloraIQ event types. Use logger from @/lib/logger.",
    "passes": true
  },
  {
    "id": "task-003",
    "title": "Create cross-module query key factory",
    "description": "Create src/lib/queryKeys.ts if not exists, or extend existing one. Add query key factories for every module — orders, products, inventory, customers, vendors, menus, storefront, analytics, notifications, messages, deliveries, compliance, payments. Each factory has list, detail, byTenant, search, and related sub-keys. Example queryKeys.orders.list(tenantId), queryKeys.orders.detail(tenantId, orderId).",
    "passes": true
  },
  {
    "id": "task-004",
    "title": "Create useQueryInvalidation hook",
    "description": "Create src/hooks/useQueryInvalidation.ts — centralizes TanStack Query invalidation logic. Methods like invalidateOrder(tenantId, orderId) that invalidates orders.detail, orders.list, related customer queries, related inventory queries, and dashboard stats. Every mutation across the app should use this hook instead of manual invalidation. Use queryClient from TanStack Query.",
    "passes": true
  },
  {
    "id": "task-005",
    "title": "Create useTenantContext unified hook",
    "description": "Create src/hooks/useTenantContext.ts that wraps useTenantAdminAuth() and adds commonly needed derived state — tenantId, tenantSlug, userId, userRole, permissions array, isAdmin boolean, isStaff boolean. Every admin component should use this instead of calling useTenantAdminAuth() directly. Memoize derived values with useMemo.",
    "passes": true
  },
  {
    "id": "task-006",
    "title": "Create shared TypeScript interfaces file",
    "description": "Create src/types/interconnected.ts with shared interfaces — OrderWithCustomer, OrderWithProducts, ProductWithInventory, CustomerWithOrders, VendorWithProducts, MenuWithProducts, DashboardStats, ActivityLogEntry, NotificationPayload, SyncStatus. These types connect entities across modules. Export all types.",
    "passes": true
  },
  {
    "id": "task-007",
    "title": "Create useRealTimeSubscription hook",
    "description": "Create src/hooks/useRealTimeSubscription.ts that wraps Supabase realtime subscriptions with tenant isolation. Accept table name, tenant_id, and callback. Auto-cleanup on unmount. Publish events to eventBus when changes arrive. Filter by tenant_id. Handle reconnection with exponential backoff. Log subscription lifecycle with logger.",
    "passes": true
  },
  {
    "id": "task-008",
    "title": "Create activity log utility",
    "description": "Create src/lib/activityLog.ts with function logActivity(tenantId, userId, action, entityType, entityId, metadata). Inserts into activity_log table via Supabase. Action types include created, updated, deleted, viewed, exported, synced. This creates the audit trail connecting all user actions across modules.",
    "passes": true
  },
  {
    "id": "task-009",
    "title": "Create useActivityLog hook",
    "description": "Create src/hooks/useActivityLog.ts — wraps activityLog utility for React components. Provides logActivity function with tenant context auto-filled from useTenantContext. Also provides useQuery for fetching recent activity filtered by entity type, entity ID, or user. Use queryKeys.activity factory.",
    "passes": true
  },
  {
    "id": "task-010",
    "title": "Create Supabase migration for activity_log table",
    "description": "Create supabase/migrations/add_activity_log_table.sql. Table columns — id uuid primary key default gen_random_uuid(), tenant_id uuid references tenants(id), user_id uuid references auth.users(id), action text not null, entity_type text not null, entity_id uuid, metadata jsonb default '{}', created_at timestamptz default now(). Add RLS policy — users can only read/write activity for their tenant. Add index on tenant_id, entity_type, created_at.",
    "passes": true
  },
  {
    "id": "task-011",
    "title": "Create useNotificationDispatcher hook",
    "description": "Create src/hooks/useNotificationDispatcher.ts that listens to eventBus events and creates in-app notifications. When order_created fires, notify admin. When inventory_changed fires and stock is low, notify inventory manager. When customer_updated fires, log it. Store notifications in Supabase notifications table. Use useTenantContext for tenant isolation.",
    "passes": true
  },
  {
    "id": "task-012",
    "title": "Create Supabase migration for notifications table",
    "description": "Create supabase/migrations/add_notifications_table.sql. Columns — id uuid primary key, tenant_id uuid not null, user_id uuid, title text not null, message text, type text (info/warning/error/success), entity_type text, entity_id uuid, read boolean default false, created_at timestamptz default now(). RLS policy filtering by tenant_id. Index on tenant_id, user_id, read, created_at.",
    "passes": true
  },
  {
    "id": "task-013",
    "title": "Create useNotifications hook",
    "description": "Create src/hooks/useNotifications.ts — fetch unread notifications for current user and tenant. Return unreadCount, notifications array, markAsRead(id), markAllAsRead(), deleteNotification(id). Use TanStack Query with 15 second refetchInterval. Subscribe to realtime changes on notifications table. Invalidate on mutations.",
    "passes": true
  },
  {
    "id": "task-014",
    "title": "Create shared constants for entity types",
    "description": "Create src/lib/constants/entityTypes.ts — export ENTITY_TYPES object with keys ORDER, PRODUCT, CUSTOMER, VENDOR, MENU, DELIVERY, PAYMENT, INVENTORY, STOREFRONT. Each maps to the database table name. Also export ENTITY_LABELS for display names, ENTITY_ICONS mapping each to a lucide-react icon name, ENTITY_ROUTES mapping each to its admin route pattern.",
    "passes": true
  },
  {
    "id": "task-015",
    "title": "Create useEntityNavigation hook",
    "description": "Create src/hooks/useEntityNavigation.ts — given an entityType and entityId, returns the correct admin route URL including tenant slug. navigateToEntity(type, id) uses react-router navigate. getEntityUrl(type, id) returns the URL string. This is the single source of truth for cross-module navigation. Uses ENTITY_ROUTES from constants.",
    "passes": true
  },
  {
    "id": "task-016",
    "title": "Create shared loading skeleton components",
    "description": "Create src/components/admin/shared/LoadingSkeletons.tsx with reusable skeleton components — TableSkeleton(rows, cols), CardSkeleton, StatCardSkeleton, ListItemSkeleton, DetailPageSkeleton, FormSkeleton. Use shadcn/ui Skeleton component. All admin pages should use these for consistent loading states.",
    "passes": true
  },
  {
    "id": "task-017",
    "title": "Create shared error boundary component",
    "description": "Create src/components/admin/shared/ModuleErrorBoundary.tsx — a React error boundary that catches errors in admin modules and shows a friendly error state with retry button. Logs error to logger.error with module name and error details. Shows toast notification via sonner. Renders fallback UI with the module name and retry action.",
    "passes": true
  },
  {
    "id": "task-018",
    "title": "Create shared empty state component",
    "description": "Create src/components/admin/shared/EmptyState.tsx — reusable empty state for any module. Props — icon (lucide-react), title, description, actionLabel, onAction, entityType. When entityType is provided, shows contextual CTA like \"Create your first order\" or \"Add a product\". Uses ENTITY_LABELS for display text.",
    "passes": true
  },
  {
    "id": "task-019",
    "title": "Create useSyncStatus hook",
    "description": "Create src/hooks/useSyncStatus.ts — tracks sync status between modules. Returns syncStatus object with lastSynced timestamp, isSyncing boolean, syncError string or null, and triggerSync function. Listens to eventBus for sync events. Stores last sync time in localStorage via STORAGE_KEYS. Shows sync indicator in admin header.",
    "passes": true
  },
  {
    "id": "task-020",
    "title": "Create shared toast notification utility",
    "description": "Create src/lib/notifications/toast.ts — wraps sonner toast with standardized messages for common actions. Functions like toastOrderCreated(orderNumber), toastInventoryLow(productName, quantity), toastSyncComplete(module), toastError(action, error). Each generates consistent messaging. Used across all modules for unified notification experience.",
    "passes": true
  },
  {
    "id": "task-021",
    "title": "Create usePermissions enhanced hook",
    "description": "Create or extend src/hooks/usePermissions.ts — wraps existing permission checks. Add canView(module), canEdit(module), canDelete(module), canExport(module). Modules include orders, products, customers, vendors, inventory, analytics, settings. Returns boolean for each check. Uses useTenantContext internally. Memoize permission calculations.",
    "passes": true
  },
  {
    "id": "task-022",
    "title": "Create shared data table component",
    "description": "Create src/components/admin/shared/DataTable.tsx — a reusable data table with sorting, filtering, pagination, row selection, and bulk actions. Props include columns config, data array, onRowClick, bulkActions array, searchPlaceholder, emptyState. Uses shadcn/ui Table. Supports server-side pagination. Emits selected row IDs for bulk operations.",
    "passes": true
  },
  {
    "id": "task-023",
    "title": "Create shared detail panel component",
    "description": "Create src/components/admin/shared/DetailPanel.tsx — a slide-over panel for quick-viewing any entity without navigating away. Props — isOpen, onClose, title, children, entityType, entityId, actions array. Shows related entities section at bottom. Actions include Edit, Delete, View Full Page. Transitions with framer-motion or CSS transitions.",
    "passes": true
  },
  {
    "id": "task-024",
    "title": "Create useRelatedEntities hook",
    "description": "Create src/hooks/useRelatedEntities.ts — given an entityType and entityId, fetches all related entities. For an order, returns customer, products, delivery, payment. For a customer, returns orders, total spent, last order date. For a product, returns vendor, orders containing it, current stock. Returns typed RelatedEntities object. Uses parallel TanStack queries.",
    "passes": true
  },
  {
    "id": "task-025",
    "title": "Create shared badge status component",
    "description": "Create src/components/admin/shared/StatusBadge.tsx — renders colored badges for any entity status. Props — status string, entityType. Maps order statuses (pending/confirmed/delivered/cancelled) to colors. Maps inventory statuses (in_stock/low_stock/out_of_stock) to colors. Maps customer statuses (active/inactive/vip) to colors. Uses shadcn/ui Badge variant.",
    "passes": true
  },
  {
    "id": "task-026",
    "title": "Create useGlobalSearch hook",
    "description": "Create src/hooks/useGlobalSearch.ts — searches across orders, products, customers, and vendors simultaneously. Accept search query string. Returns categorized results { orders[], products[], customers[], vendors[] } with relevance scoring. Uses Supabase ilike or full-text search. Debounce 300ms. Min 2 characters. Filter by tenant_id.",
    "passes": true
  },
  {
    "id": "task-027",
    "title": "Create global search command palette",
    "description": "Create src/components/admin/shared/CommandPalette.tsx — Cmd+K / Ctrl+K command palette. Uses useGlobalSearch hook. Groups results by entity type with icons from ENTITY_ICONS. Each result shows name, subtitle (e.g. order number, email), and status badge. Clicking navigates via useEntityNavigation. Recent searches stored in localStorage via STORAGE_KEYS. Show keyboard shortcut hints.",
    "passes": true
  },
  {
    "id": "task-028",
    "title": "Create useDashboardStats hook",
    "description": "Create src/hooks/useDashboardStats.ts — aggregates stats from all modules. Returns ordersToday, revenueToday, newCustomers, lowStockCount, pendingDeliveries, activeMenus, totalProducts, avgOrderValue. Each stat includes value, change percentage from yesterday, and trend direction (up/down/flat). Uses parallel TanStack queries. RefetchInterval 30 seconds.",
    "passes": true
  },
  {
    "id": "task-029",
    "title": "Create shared currency formatter utility",
    "description": "Create src/lib/formatters/currency.ts — formatCurrency(amount, currency) returns formatted string. Default currency USD. Also formatCompactCurrency for dashboard cards (e.g. $12.3K). Support for different locales. Used across orders, payments, analytics, and dashboard for consistent money display.",
    "passes": true
  },
  {
    "id": "task-030",
    "title": "Create shared date formatter utility",
    "description": "Create src/lib/formatters/date.ts — formatDate(date, format), formatRelative(date) returns \"2 hours ago\" or \"Yesterday\", formatDateRange(start, end). Timezone-aware using tenant settings. Used across all modules for consistent date display. Export as named functions.",
    "passes": true
  },
  {
    "id": "task-031",
    "title": "Create useLocalStorage hook",
    "description": "Create or verify src/hooks/useLocalStorage.ts — wraps localStorage with STORAGE_KEYS. Type-safe get/set with JSON parse/stringify. Try-catch wrapped. Supports default values. SSR-safe with typeof window check. Used for persisting user preferences like table column visibility, sort order, sidebar state across modules.",
    "passes": true
  },
  {
    "id": "task-032",
    "title": "Create Supabase migration for inventory_history table",
    "description": "Create supabase/migrations/add_inventory_history.sql. Columns — id uuid primary key, tenant_id uuid not null, product_id uuid not null, quantity_before integer, quantity_after integer, quantity_change integer, reason text (order_confirmed, order_cancelled, manual_adjustment, restock, sync), reference_id uuid, user_id uuid, created_at timestamptz default now(). RLS by tenant_id. Index on product_id, created_at.",
    "passes": true
  },
  {
    "id": "task-033",
    "title": "Create useInventoryHistory hook",
    "description": "Create src/hooks/useInventoryHistory.ts — fetch inventory change history for a product or across all products. Accepts productId (optional) and dateRange. Returns history entries with formatted changes. Used in product detail view and inventory reports. Includes calculated fields like running total. Uses queryKeys.inventory.history factory.",
    "passes": true
  },
  {
    "id": "task-034",
    "title": "Create shared confirmation dialog component",
    "description": "Create src/components/admin/shared/ConfirmDialog.tsx — reusable confirmation modal using shadcn/ui AlertDialog. Props — isOpen, onConfirm, onCancel, title, description, confirmLabel, variant (default/destructive). Used for delete confirmations, status changes, bulk operations across all modules. Destructive variant shows red button.",
    "passes": true
  },
  {
    "id": "task-035",
    "title": "Create shared form field components",
    "description": "Create src/components/admin/shared/FormFields.tsx — reusable form field wrappers for React Hook Form. Components — TextField, SelectField, NumberField, DateField, TextareaField, SwitchField, ComboboxField. Each integrates with react-hook-form Controller and shows validation errors from Zod. Consistent styling across all admin forms.",
    "passes": true
  },
  {
    "id": "task-036",
    "title": "Create useFormPersistence hook",
    "description": "Create src/hooks/useFormPersistence.ts — auto-saves form state to localStorage so users don't lose work if they navigate away. Accept formId and form values. Debounce saves by 1 second. Provide restoreForm() to load saved data. clearSavedForm() on successful submit. Uses STORAGE_KEYS with form-specific prefix.",
    "passes": true
  },
  {
    "id": "task-037",
    "title": "Create shared export utility",
    "description": "Create src/lib/export.ts — exportToCSV(data, columns, filename), exportToJSON(data, filename). Handles date formatting, nested objects, and special characters. Creates download link. Logs export action via activityLog. Used in orders, products, customers, inventory reports. Accept column config for header mapping.",
    "passes": true
  },
  {
    "id": "task-038",
    "title": "Create useExport hook",
    "description": "Create src/hooks/useExport.ts — wraps export utility with React state. Returns exportCSV, exportJSON, isExporting boolean. Accepts data and column config. Shows toast on success/error. Logs export via useActivityLog. Progress indicator for large datasets. Used by any admin data table.",
    "passes": true
  },
  {
    "id": "task-039",
    "title": "Create shared filter bar component",
    "description": "Create src/components/admin/shared/FilterBar.tsx — reusable filter bar with date range picker, status dropdown, search input, and custom filter slots. Props — filters config array, onFilterChange, activeFilters object, onClear. Persists active filters to localStorage. Shows active filter count badge. Used across orders, products, customers pages.",
    "passes": true
  },
  {
    "id": "task-040",
    "title": "Create usePagination hook",
    "description": "Create src/hooks/usePagination.ts — manages pagination state for data tables. Returns page, pageSize, setPage, setPageSize, offset, totalPages. Integrates with URL search params via React Router so pagination persists on refresh. Supports configurable page sizes [10, 25, 50, 100]. Used by all data table instances.",
    "passes": true
  },
  {
    "id": "task-041",
    "title": "Create shared page header component",
    "description": "Create src/components/admin/shared/PageHeader.tsx — consistent page header for all admin pages. Props — title, subtitle, breadcrumbs array, actions (React nodes for buttons), badge (optional status badge). Renders breadcrumb trail using react-router links with tenant slug. Actions align right. Used on every admin page for consistent layout.",
    "passes": true
  },
  {
    "id": "task-042",
    "title": "Create useBreadcrumbs hook",
    "description": "Create src/hooks/useBreadcrumbs.ts — auto-generates breadcrumb trail from current route path. Maps route segments to human-readable labels using ENTITY_LABELS. Includes tenant dashboard as root. Returns array of { label, href } objects. Dynamic segments (IDs) resolved to entity names via lightweight queries.",
    "passes": true
  },
  {
    "id": "task-043",
    "title": "Create shared sidebar navigation component",
    "description": "Create src/components/admin/shared/AdminSidebar.tsx — main admin sidebar with collapsible sections. Groups — Dashboard, Orders, Products & Inventory, Customers, Vendors, Menus & Storefront, Deliveries, Analytics, Settings. Each item shows icon and label. Active item highlighted. Badge counts for pending orders, low stock, unread notifications. Collapse to icon-only mode. Persists collapsed state.",
    "passes": true
  },
  {
    "id": "task-044",
    "title": "Create useSidebarBadges hook",
    "description": "Create src/hooks/useSidebarBadges.ts — fetches badge counts for sidebar navigation items. Returns pendingOrdersCount, lowStockCount, unreadNotificationsCount, pendingDeliveriesCount. Uses lightweight count queries with tenant_id filter. RefetchInterval 30 seconds. Subscribes to realtime changes for instant updates. Returns formatted badge values.",
    "passes": true
  },
  {
    "id": "task-045",
    "title": "Create shared admin layout wrapper",
    "description": "Create src/components/admin/shared/AdminLayout.tsx — wraps all admin pages with consistent layout. Includes AdminSidebar, top header bar with notification bell and command palette trigger, breadcrumbs, and main content area. Handles responsive layout — sidebar collapses to hamburger on mobile. Provides layout context for nested components.",
    "passes": true
  },
  {
    "id": "task-046",
    "title": "Create notification bell component",
    "description": "Create src/components/admin/shared/NotificationBell.tsx — bell icon in admin header. Shows unread count badge. Click opens dropdown with recent notifications grouped by type. Each notification links to related entity via useEntityNavigation. Mark as read on click. Mark all as read button. Uses useNotifications hook. Realtime updates via subscription.",
    "passes": true
  },
  {
    "id": "task-047",
    "title": "Create useOnlineStatus hook",
    "description": "Create src/hooks/useOnlineStatus.ts — tracks browser online/offline status. Shows banner when offline. Queues mutations when offline, replays when online. Integrates with TanStack Query's onlineManager. Shows sync indicator when reconnecting. Publishes connection_status events to eventBus. Critical for field staff using mobile admin.",
    "passes": true
  },
  {
    "id": "task-048",
    "title": "Create shared stats card component",
    "description": "Create src/components/admin/shared/StatsCard.tsx — reusable stat card for dashboards. Props — title, value, change (percentage), trend (up/down/flat), icon, onClick, loading. Shows sparkline or mini chart if data array provided. Change shown in green (positive) or red (negative). Used in dashboard, analytics, and module overview pages.",
    "passes": true
  },
  {
    "id": "task-049",
    "title": "Create useModuleHealth hook",
    "description": "Create src/hooks/useModuleHealth.ts — checks health/connectivity of each module. Returns status object with each module name and its status (healthy/degraded/error). Checks can products be fetched, can orders be created, can customers be queried, etc. Shows in admin header as subtle status indicator. Helps debug interconnectivity issues.",
    "passes": true
  },
  {
    "id": "task-050",
    "title": "Create order creation with inventory validation",
    "description": "In the order creation flow (src/pages/admin/ or src/components/admin/orders/), before submitting an order, validate that all selected products have sufficient inventory. Show inline warnings for low-stock items. Block submission for out-of-stock items. Display current stock level next to each product in the order form. Use useLowStockAlerts or direct inventory queries filtered by tenant_id.",
    "passes": false
  },
  {
    "id": "task-051",
    "title": "Create order confirmation inventory decrement",
    "description": "When an order status changes to confirmed, automatically decrement inventory for all order line items. Create src/hooks/useOrderConfirmation.ts that accepts orderId, fetches order items, decrements each product's stock_quantity. Log each change to inventory_history with reason order_confirmed and reference_id = orderId. Use TanStack Query mutation with optimistic update. Invalidate both orders and products queries.",
    "passes": false
  },
  {
    "id": "task-052",
    "title": "Create order cancellation inventory restore",
    "description": "When an order is cancelled, restore inventory for all line items. In the order cancellation handler, increment each product's stock_quantity by the cancelled quantity. Log to inventory_history with reason order_cancelled. Show confirmation dialog before cancelling. Toast notification on completion. Invalidate orders, products, inventory queries via useQueryInvalidation.",
    "passes": false
  },
  {
    "id": "task-053",
    "title": "Create order-customer link in order list",
    "description": "In the orders list/table view, each order row should display the customer name as a clickable link. Clicking navigates to the customer detail page via useEntityNavigation(CUSTOMER, customerId). Show customer avatar or initials badge next to name. If no customer assigned, show \"Walk-in\" label. Tooltip shows customer email on hover.",
    "passes": false
  },
  {
    "id": "task-054",
    "title": "Create order-customer automatic association",
    "description": "When creating an order, if a phone number or email is entered, auto-search existing customers. If found, associate the order with that customer automatically. If not found, offer to create a new customer from the order details. Use useGlobalSearch or direct customer lookup. This connects every order to the customer module.",
    "passes": false
  },
  {
    "id": "task-055",
    "title": "Create order detail page with related entities panel",
    "description": "Build or enhance the order detail page to show a RelatedEntities section. Display linked customer card, product thumbnails with quantities, payment status, delivery tracking, and order timeline. Each related entity is clickable and navigates to its detail page. Use useRelatedEntities hook. Show all data without requiring navigation away.",
    "passes": false
  },
  {
    "id": "task-056",
    "title": "Create order timeline component",
    "description": "Create src/components/admin/orders/OrderTimeline.tsx — shows chronological timeline of all order events. Events include created, confirmed, payment_received, items_picked, out_for_delivery, delivered, cancelled, refunded. Each event shows timestamp, user who performed action, and any notes. Pull from activity_log filtered by entity_type=order and entity_id. Auto-updates via realtime subscription.",
    "passes": false
  },
  {
    "id": "task-057",
    "title": "Create order status change with notification dispatch",
    "description": "When order status changes, dispatch notifications to relevant parties. Use useNotificationDispatcher. Notify admin on new order, notify delivery runner on confirmed, notify customer (if contact info exists) on out_for_delivery and delivered. Each notification includes order number, customer name, and new status. Log status change to activity_log.",
    "passes": false
  },
  {
    "id": "task-058",
    "title": "Create order payment status sync",
    "description": "On the order detail page, show payment status from the payments table. If payment is pending, show pay button. If paid, show payment method and transaction ID. Payment status changes should update order display in real-time via Supabase subscription. When payment is received, auto-update order status if configured. Invalidate order queries on payment change.",
    "passes": false
  },
  {
    "id": "task-059",
    "title": "Create order delivery status sync",
    "description": "On the order detail page, show delivery status if order has an associated delivery. Show runner name, current status, estimated time, and real-time location if available. Delivery status changes reflect immediately on order detail via realtime subscription. When delivery marked as completed, auto-update order status to delivered.",
    "passes": false
  },
  {
    "id": "task-060",
    "title": "Create order product quick view",
    "description": "In the order detail page, clicking a product in the order items list opens a DetailPanel showing product details — image, description, current stock, vendor, category, price history. The panel includes a link to the full product page. Useful for quickly checking product info without leaving the order context.",
    "passes": false
  },
  {
    "id": "task-061",
    "title": "Create order items with real-time stock display",
    "description": "In the order creation/edit form, each product line item should show real-time current stock level next to the quantity input. If stock drops below the requested quantity while editing (another order takes it), show warning. Use Supabase realtime subscription on products table for live stock updates. Prevent over-ordering.",
    "passes": false
  },
  {
    "id": "task-062",
    "title": "Create order duplicate/reorder functionality",
    "description": "Add a \"Duplicate Order\" button on order detail page. Creates a new order with the same products and quantities, pre-filled customer. Validates current stock availability before creating. Shows dialog with any items that are now out of stock. Useful for repeat orders. Navigate to new order on creation.",
    "passes": false
  },
  {
    "id": "task-063",
    "title": "Create order notes with @mentions",
    "description": "Add an internal notes section to order detail page. Staff can add notes with @mentions of other staff members. When mentioned, that user gets a notification via useNotificationDispatcher. Notes stored in order_notes table with tenant_id, order_id, user_id, content, created_at. Display as threaded comments with user avatars.",
    "passes": false
  },
  {
    "id": "task-064",
    "title": "Create Supabase migration for order_notes table",
    "description": "Create supabase/migrations/add_order_notes.sql. Columns — id uuid primary key, tenant_id uuid not null, order_id uuid not null references orders(id), user_id uuid not null, content text not null, mentioned_user_ids uuid[] default '{}', created_at timestamptz default now(). RLS by tenant_id. Index on order_id, created_at.",
    "passes": false
  },
  {
    "id": "task-065",
    "title": "Create order print/receipt generation",
    "description": "Create src/components/admin/orders/OrderReceipt.tsx — generates printable receipt for an order. Includes business name from tenant settings, order number, date, customer info, line items with prices, subtotal, tax, total, payment method. Print button opens browser print dialog with print-optimized CSS. Also export as PDF option.",
    "passes": false
  },
  {
    "id": "task-066",
    "title": "Create order analytics connection",
    "description": "When viewing an order, show contextual analytics — is this customer's largest order, how does it compare to average order value, what time of day was it placed, is the product mix typical. Pull from analytics calculations. Small insights section on order detail. Connects order view to analytics module naturally.",
    "passes": false
  },
  {
    "id": "task-067",
    "title": "Create order filters with cross-module data",
    "description": "Enhance order list FilterBar with filters for customer name, product name, payment status, delivery status, date range, order total range, and order source (admin/storefront/menu). Each filter queries its respective module's data. Combined filters work with AND logic. Active filters shown as removable chips. Persist filter state.",
    "passes": false
  },
  {
    "id": "task-068",
    "title": "Create order bulk status update",
    "description": "In orders DataTable, allow multi-select rows and bulk status update. Select multiple orders → choose new status from dropdown → confirm → update all. Each status change triggers inventory sync, notification dispatch, and activity log. Show progress bar for bulk operations. Toast with success count and any failures.",
    "passes": false
  },
  {
    "id": "task-069",
    "title": "Create order bulk assignment to runner",
    "description": "In orders DataTable, allow selecting multiple confirmed orders and assigning them to a delivery runner in bulk. Show runner dropdown with available runners. On assign, create delivery records for each order linked to the runner. Notify runner via notification. Update order status to assigned. Uses delivery module hooks.",
    "passes": false
  },
  {
    "id": "task-070",
    "title": "Create order export with related data",
    "description": "Enhance order export to include related data — customer name, customer email, product names, payment status, delivery status. Export as CSV or JSON with all these joined fields. Use useExport hook. Column config maps to joined data. Show loading state during export. Log export action to activity_log.",
    "passes": false
  },
  {
    "id": "task-071",
    "title": "Create order refund with inventory restore",
    "description": "Add refund action on paid orders. Refund flow — select items to refund (partial or full), enter reason, confirm. On refund, restore inventory for refunded items (log to inventory_history with reason order_refunded). Update payment record with refund amount. Create refund activity log entry. Notify admin and customer. Update order status.",
    "passes": false
  },
  {
    "id": "task-072",
    "title": "Create order source tracking",
    "description": "Track where each order originates — admin_panel, storefront, disposable_menu, api, pos. Store as source field on orders table. Show source badge in order list and detail. Filter orders by source. Analytics can break down orders by source. When orders come from storefront or menu, include the menu_id or storefront_session_id for traceability.",
    "passes": false
  },
  {
    "id": "task-073",
    "title": "Create order storefront session link",
    "description": "If an order originated from a storefront or disposable menu, link it back to the session. Show on order detail — which menu was used, customer's browsing time, items they viewed before ordering. Creates direct connection between storefront module and orders module. Helps understand customer journey.",
    "passes": false
  },
  {
    "id": "task-074",
    "title": "Create order auto-assign rules",
    "description": "Create src/components/admin/settings/OrderAutoAssign.tsx — settings page where admin configures auto-assignment rules. Rules like — orders over $X go to senior runner, orders in zone A go to runner 1, orders with specific products go to specific runner. Rules stored in tenant_settings jsonb. Applied automatically when order is confirmed.",
    "passes": false
  },
  {
    "id": "task-075",
    "title": "Create order recurring/subscription support",
    "description": "Add ability to mark an order as recurring. Create src/components/admin/orders/RecurringOrderSetup.tsx — select frequency (daily/weekly/biweekly/monthly), start date, end date. Store in recurring_orders table. Dashboard shows upcoming recurring orders. Notification before each recurrence. Auto-creates order from template with inventory validation.",
    "passes": false
  },
  {
    "id": "task-076",
    "title": "Create Supabase migration for recurring_orders table",
    "description": "Create supabase/migrations/add_recurring_orders.sql. Columns — id uuid primary key, tenant_id uuid not null, template_order_id uuid references orders(id), customer_id uuid, frequency text (daily/weekly/biweekly/monthly), next_run_date date, end_date date, is_active boolean default true, created_at timestamptz default now(). RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-077",
    "title": "Create order priority system",
    "description": "Add priority field to orders (low/normal/high/urgent). High and urgent orders show at top of list with colored indicator. Urgent orders trigger immediate notification to admin. Priority auto-set based on rules — VIP customers get high priority, large orders get high priority. Configurable in tenant settings. Filter and sort by priority.",
    "passes": false
  },
  {
    "id": "task-078",
    "title": "Create order-to-invoice generation",
    "description": "Create src/components/admin/orders/InvoiceGenerator.tsx — generates invoice from order. Includes business details from tenant profile, customer billing info, itemized products with prices, tax calculation, payment terms. Saves as PDF. Links invoice record to order and customer. Invoice number auto-generated from tenant sequence.",
    "passes": false
  },
  {
    "id": "task-079",
    "title": "Create order split functionality",
    "description": "Allow splitting one order into multiple orders. Use case — customer wants to ship some items now and some later. Split creates new order(s) with selected items, adjusts original order totals. Both orders reference the original via parent_order_id. Activity log tracks the split. Customer can see all related orders.",
    "passes": false
  },
  {
    "id": "task-080",
    "title": "Create order merge functionality",
    "description": "Allow merging multiple orders from the same customer into one. Select orders from order list → merge → creates new combined order with all items. Original orders marked as merged with reference to new order. Useful when customer places multiple small orders. Recalculates totals and applies any combined discounts.",
    "passes": false
  },
  {
    "id": "task-081",
    "title": "Create order SLA tracking",
    "description": "Track time-based SLA metrics for orders. Calculate time from created to confirmed, confirmed to dispatched, dispatched to delivered. Show SLA indicators on order list — green if within target, yellow if approaching, red if overdue. SLA targets configurable in tenant settings. Dashboard widget shows SLA compliance percentage.",
    "passes": false
  },
  {
    "id": "task-082",
    "title": "Create order pinned notes for dashboard",
    "description": "Allow marking an order note as pinned. Pinned notes show on the dashboard in a \"Requires Attention\" section. Useful for flagging issues — wrong address, customer callback needed, product substitution required. Pinned notes cleared when action is taken. Creates direct dashboard-to-order interconnection.",
    "passes": false
  },
  {
    "id": "task-083",
    "title": "Create order history diff view",
    "description": "When order is edited, show what changed. Create src/components/admin/orders/OrderHistoryDiff.tsx — compares before/after states. Highlights changed fields in the timeline. Shows who made the change and when. Diff includes quantity changes, status changes, price adjustments, customer changes. Pulled from activity_log metadata.",
    "passes": false
  },
  {
    "id": "task-084",
    "title": "Create order communication log",
    "description": "Create src/components/admin/orders/OrderComms.tsx — shows all communications related to an order. Includes SMS sent to customer, emails, internal notes, notification history. Aggregated from notifications and messages tables. Chronological view. Shows delivery status and read receipts where available. Useful for customer service inquiries.",
    "passes": false
  },
  {
    "id": "task-085",
    "title": "Create product detail page with order history",
    "description": "On the product detail page, add a section showing recent orders containing this product. Display order number, date, quantity ordered, customer name as clickable links. Show total units sold this week/month/all-time. Paginated list with DataTable. Use queryKeys.orders.byProduct(tenantId, productId).",
    "passes": false
  },
  {
    "id": "task-086",
    "title": "Create product detail page with inventory chart",
    "description": "On product detail page, add an inventory history chart showing stock levels over time. Use recharts LineChart. X-axis is dates, Y-axis is stock quantity. Plot inventory_history entries. Show restock events as green dots, order deductions as red dots. Hover shows event details. Time range selector — 7d/30d/90d.",
    "passes": false
  },
  {
    "id": "task-087",
    "title": "Create product detail page with vendor info",
    "description": "On product detail page, show vendor information card — vendor name (clickable link to vendor detail), contact info, last restock date, average lead time, vendor reliability score. If product has multiple vendor sources, show all. Quick action to reorder from vendor. Connects product view directly to vendor module.",
    "passes": false
  },
  {
    "id": "task-088",
    "title": "Create product detail page with menu appearances",
    "description": "On product detail page, show which menus/storefronts currently feature this product. List of active menus with links. Show pricing on each menu (may differ). Toggle to add/remove from menus directly. This connects product module to menu/storefront module bidirectionally.",
    "passes": false
  },
  {
    "id": "task-089",
    "title": "Create product detail page with compliance status",
    "description": "On product detail page, show compliance status — lab test results, expiration date, license coverage, regulatory notes. Red warning if approaching expiration or missing compliance data. Link to compliance module for full details. Critical for cannabis industry — every product must be traceable to its compliance records.",
    "passes": false
  },
  {
    "id": "task-090",
    "title": "Create product inventory auto-reorder trigger",
    "description": "When product stock falls below low_stock_threshold, auto-create a reorder suggestion. Create src/hooks/useAutoReorder.ts — monitors inventory levels, generates reorder recommendations with suggested quantity based on sales velocity. Show reorder suggestions on product detail and dashboard. One-click to create purchase order to vendor.",
    "passes": false
  },
  {
    "id": "task-091",
    "title": "Create product category management with counts",
    "description": "Create or enhance category management page. Each category shows product count, total stock value, revenue generated, best seller. Categories link to filtered product list. Adding/removing products from categories updates counts in real-time. Category tree supports nesting. Uses TanStack Query with category key factory.",
    "passes": false
  },
  {
    "id": "task-092",
    "title": "Create product variant system",
    "description": "Create src/components/admin/products/ProductVariants.tsx — manage product variants (size, strain, weight). Each variant has its own SKU, price, stock level. Variants share the parent product's vendor, category, and compliance data. Order line items reference specific variant. Inventory tracked per variant. Display variant selector in order creation and storefront.",
    "passes": false
  },
  {
    "id": "task-093",
    "title": "Create product image gallery with menu preview",
    "description": "Enhance product image management. Multiple images per product with drag-to-reorder. Primary image shown in lists and menus. Preview how product appears on disposable menu and storefront. Image optimization for web display. Stored in Supabase Storage with tenant-specific bucket path. Lazy loading in lists.",
    "passes": false
  },
  {
    "id": "task-094",
    "title": "Create product pricing history",
    "description": "Track product price changes over time. Create pricing_history table or jsonb column. Show price history chart on product detail page. When price changes, log to activity_log. Show previous price with strikethrough in menus if recently changed. Price change affects all active menus automatically — sync via eventBus.",
    "passes": false
  },
  {
    "id": "task-095",
    "title": "Create product clone/duplicate",
    "description": "Add duplicate product action. Copies all product details (name, description, category, images, pricing) to a new product. Generates new SKU. Does not copy inventory or order history. Useful for creating variations. Navigates to new product for editing. Log duplication to activity_log.",
    "passes": false
  },
  {
    "id": "task-096",
    "title": "Create product bulk import from CSV",
    "description": "Create src/components/admin/products/ProductImport.tsx — upload CSV file with product data. Parse CSV, validate fields, show preview with error highlighting. Support columns name, sku, price, category, vendor, stock_quantity, description. On import, create products and initial inventory entries. Log import action. Show import results summary.",
    "passes": false
  },
  {
    "id": "task-097",
    "title": "Create product bulk export with full data",
    "description": "Export all products with related data — category name, vendor name, current stock, total orders, revenue generated, compliance status, active menu count. CSV and JSON formats. Use useExport hook. Include column selection dialog. Log export to activity_log. Useful for reporting and external system integration.",
    "passes": false
  },
  {
    "id": "task-098",
    "title": "Create product search with advanced filters",
    "description": "Enhance product list with advanced search. Filter by category, vendor, stock status (in stock/low/out), price range, compliance status, menu status (listed/unlisted), created date range. Text search across name, SKU, description. Combine filters with AND logic. Show active filter count. Persist filter state. Debounced search.",
    "passes": false
  },
  {
    "id": "task-099",
    "title": "Create product price update with menu sync",
    "description": "When a product's price is updated, automatically sync the new price to all active menus and storefronts featuring that product. Show confirmation dialog listing affected menus before saving. Option to update menu prices or keep menu-specific pricing. Publish price_updated event to eventBus. Toast notification listing updated menus.",
    "passes": false
  },
  {
    "id": "task-100",
    "title": "Create product stock adjustment modal",
    "description": "Create src/components/admin/products/StockAdjustment.tsx — modal for manually adjusting product stock. Fields — adjustment type (add/remove/set), quantity, reason (restock, damaged, correction, audit), notes. On submit, update stock_quantity and log to inventory_history. Invalidate product and inventory queries. Used from product detail and inventory list.",
    "passes": false
  },
  {
    "id": "task-101",
    "title": "Create product-vendor reorder automation",
    "description": "Create src/components/admin/products/ReorderSettings.tsx — per-product reorder configuration. Set reorder_point (threshold), reorder_quantity (how many to order), preferred_vendor_id. When stock hits reorder_point, auto-generate purchase order draft linked to vendor. Dashboard shows pending reorders. Vendor module shows incoming purchase orders.",
    "passes": false
  },
  {
    "id": "task-102",
    "title": "Create product bundle/kit support",
    "description": "Create src/components/admin/products/ProductBundle.tsx — define product bundles (kits). A bundle contains multiple products with specified quantities. Bundle has its own price (usually discounted). When bundle is ordered, decrement inventory for each component product. Show component products on bundle detail. Track bundle sales separately.",
    "passes": false
  },
  {
    "id": "task-103",
    "title": "Create product performance analytics card",
    "description": "On product detail page, add analytics card showing — units sold (7d/30d/90d), revenue generated, average order quantity, sales trend chart (recharts), customer segments buying this product, best performing day of week, comparison to category average. Connects product module to analytics module.",
    "passes": false
  },
  {
    "id": "task-104",
    "title": "Create product QR code generator",
    "description": "Create src/components/admin/products/ProductQR.tsx — generate QR code for any product. QR links to product on storefront or disposable menu. Options — link to specific menu, include price, include lab results URL. Download as PNG or print. Bulk QR generation for all products. Uses qrcode library.",
    "passes": false
  },
  {
    "id": "task-105",
    "title": "Create inventory dashboard page",
    "description": "Create src/pages/admin/InventoryDashboard.tsx — overview of all inventory. Stats cards for total products, total stock value, low stock count, out of stock count. Stock level distribution chart. Recent inventory changes timeline. Low stock alerts list with one-click reorder. Category-wise stock breakdown. Uses multiple TanStack queries.",
    "passes": false
  },
  {
    "id": "task-106",
    "title": "Create inventory movement report",
    "description": "Create src/components/admin/inventory/MovementReport.tsx — detailed report of all inventory movements over a date range. Filter by product, reason, user. Show table with product name, date, change, reason, order reference, user. Totals row. Export to CSV. Connects inventory_history to orders (via reference_id) and users. Sortable columns.",
    "passes": false
  },
  {
    "id": "task-107",
    "title": "Create inventory audit tool",
    "description": "Create src/pages/admin/InventoryAudit.tsx — physical inventory audit workflow. List all products with expected stock vs actual count entry. Highlight discrepancies. Submit audit creates adjustment entries in inventory_history with reason audit. Generate audit report PDF. Track audit history. Permission-gated to admin role.",
    "passes": false
  },
  {
    "id": "task-108",
    "title": "Create inventory valuation report",
    "description": "Create src/components/admin/inventory/ValuationReport.tsx — shows total inventory value by product and category. Calculate using product price × quantity. Show cost basis if purchase price tracked. Compare current value to last period. Export report. Useful for financial reporting. Connects inventory to product pricing.",
    "passes": false
  },
  {
    "id": "task-109",
    "title": "Create inventory alerts settings page",
    "description": "Create src/components/admin/settings/InventoryAlerts.tsx — configure inventory alert thresholds globally and per-product. Global defaults for low_stock_threshold and critical_stock_threshold. Override per product. Configure notification channels — in-app, email. Set recheck frequency. Save to tenant_settings or product columns.",
    "passes": false
  },
  {
    "id": "task-110",
    "title": "Create product-order velocity calculation",
    "description": "Create src/hooks/useProductVelocity.ts — calculates how fast a product sells. Returns units_per_day, days_until_stockout, reorder_urgency (normal/soon/urgent/overdue). Used in product detail, inventory dashboard, and reorder suggestions. Calculated from order history over the last 30 days. Cached with TanStack Query.",
    "passes": false
  },
  {
    "id": "task-111",
    "title": "Create stock transfer between locations",
    "description": "If tenant has multiple locations, create stock transfer flow. Create src/components/admin/inventory/StockTransfer.tsx — select source location, destination, products, quantities. Creates paired inventory_history entries (decrease at source, increase at destination). Transfer tracking with status. Notification to destination location admin.",
    "passes": false
  },
  {
    "id": "task-112",
    "title": "Create product archive with data preservation",
    "description": "Product archive (soft delete) functionality. Archived products hidden from active lists, menus, and order creation. Archived products retain their order history and analytics data. Can be un-archived. Show archived products in separate filtered view. Archive triggers menu sync — removes from active menus. Log to activity_log.",
    "passes": false
  },
  {
    "id": "task-113",
    "title": "Create product tags system",
    "description": "Create tagging system for products. Tags are tenant-specific (stored in product_tags table). Multiple tags per product. Filter products by tags. Tags displayed as colored chips. Create/edit/delete tags. Auto-suggest existing tags when adding. Popular tags shown in filter bar. Tags shared across product list, menus, and search results.",
    "passes": false
  },
  {
    "id": "task-114",
    "title": "Create Supabase migration for product_tags table",
    "description": "Create supabase/migrations/add_product_tags.sql. Table tags — id uuid primary key, tenant_id uuid not null, name text not null, color text default '#gray', created_at timestamptz. Table product_tag_assignments — id uuid primary key, product_id uuid not null, tag_id uuid not null, unique constraint on (product_id, tag_id). RLS by tenant_id on both tables.",
    "passes": false
  },
  {
    "id": "task-115",
    "title": "Create product comparison view",
    "description": "Create src/components/admin/products/ProductComparison.tsx — select 2-4 products to compare side by side. Compare price, stock, sales velocity, revenue, vendor, category, compliance status. Highlight differences. Useful for deciding which products to promote or discontinue. Accessible from product list via multi-select action.",
    "passes": false
  },
  {
    "id": "task-116",
    "title": "Create product storefront preview",
    "description": "On product detail page, add a \"Preview on Storefront\" button. Opens a preview panel or new tab showing exactly how this product appears on the storefront and any active menus. Shows all product data as customer sees it. Useful for verifying product listings without visiting the actual storefront. Connects product to storefront module.",
    "passes": false
  },
  {
    "id": "task-117",
    "title": "Create product cost tracking",
    "description": "Add cost_price field to products (wholesale/purchase cost). Calculate and display margin percentage and margin amount on product detail. Show margin in product list as hidden column. Margin alerts if margin drops below configurable threshold. Used in analytics for profitability reports. Connects to vendor purchase orders.",
    "passes": false
  },
  {
    "id": "task-118",
    "title": "Create inventory forecasting",
    "description": "Create src/hooks/useInventoryForecast.ts — predicts when each product will go out of stock based on sales velocity. Returns forecast_stockout_date, recommended_reorder_date, recommended_reorder_quantity. Display on product detail and inventory dashboard. Uses last 30 days order data for velocity calculation. Warning badges for items approaching stockout.",
    "passes": false
  },
  {
    "id": "task-119",
    "title": "Create product related products suggestion",
    "description": "Create src/hooks/useRelatedProducts.ts — suggests related products based on order co-occurrence. Products frequently ordered together are related. Show \"Frequently Bought Together\" on product detail. Used in storefront for cross-selling. Calculate from order_items data. Cache results. Update weekly.",
    "passes": false
  },
  {
    "id": "task-120",
    "title": "Create inventory low stock email digest",
    "description": "Create Supabase Edge Function for daily low stock email digest. Queries products below threshold per tenant. Formats email with product name, current stock, reorder point, days until stockout. Sends to admin email. Scheduled via pg_cron. Configurable in tenant alert settings. Connects inventory monitoring to external communication.",
    "passes": false
  },
  {
    "id": "task-121",
    "title": "Create product weight and dimension tracking",
    "description": "Add weight, length, width, height fields to products. Used for shipping cost calculation in order module. Display on product detail. Required for delivery route optimization. Bulk update dimensions via import. Show dimensional data in order summary for delivery planning.",
    "passes": false
  },
  {
    "id": "task-122",
    "title": "Create customer detail page with order history",
    "description": "On customer detail page, show complete order history table. Columns — order number, date, total, status, items count, payment status. Clickable rows navigate to order detail. Show order count and total lifetime value stats above. Paginated with DataTable. Sorted newest first. Filter by status and date range.",
    "passes": false
  },
  {
    "id": "task-123",
    "title": "Create customer detail page with payment history",
    "description": "On customer detail page, show payment history. All payments across all orders. Columns — date, amount, method, order reference, status. Running total of paid vs outstanding. Payment trends chart. Links to individual order and payment records. Useful for resolving billing issues.",
    "passes": false
  },
  {
    "id": "task-124",
    "title": "Create customer detail page with delivery addresses",
    "description": "On customer detail page, show saved delivery addresses. Primary address marked with star. Edit/delete addresses. Add new address with geocoding. Map preview of address. When creating order for this customer, auto-populate address selector. Link to delivery zone mapping.",
    "passes": false
  },
  {
    "id": "task-125",
    "title": "Create customer lifetime value calculation",
    "description": "Create src/hooks/useCustomerLTV.ts — calculates customer lifetime value. Total spend, order count, average order value, order frequency (days between orders), predicted next order date, customer since date. Show as prominent stat on customer detail. Used in customer list sorting. LTV segments — new/regular/valuable/vip. Based on order and payment data.",
    "passes": false
  },
  {
    "id": "task-126",
    "title": "Create customer segmentation engine",
    "description": "Create src/hooks/useCustomerSegments.ts — segments customers into groups. Segments include new (first order within 30d), active (ordered within 60d), at_risk (no order in 60-90d), churned (no order in 90d+), vip (top 10% by LTV). Show segment badge on customer list and detail. Filter by segment. Segment counts on customer dashboard. Auto-calculated from order dates.",
    "passes": false
  },
  {
    "id": "task-127",
    "title": "Create customer tag system",
    "description": "Similar to product tags, create customer tagging. Tags like wholesale, retail, preferred, flagged, special_pricing. Multiple tags per customer. Filter customer list by tags. Tags visible on customer card in order creation. Auto-tag rules — e.g. auto-tag as vip when LTV exceeds threshold. Stored in customer_tags table with tenant_id RLS.",
    "passes": false
  },
  {
    "id": "task-128",
    "title": "Create Supabase migration for customer_tags table",
    "description": "Create supabase/migrations/add_customer_tags.sql. Table customer_tags — id uuid primary key, tenant_id uuid not null, name text, color text, created_at timestamptz. Table customer_tag_assignments — id uuid primary key, customer_id uuid not null, tag_id uuid not null, unique constraint. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-129",
    "title": "Create customer notes with timeline",
    "description": "Create src/components/admin/customers/CustomerNotes.tsx — internal notes timeline on customer detail page. Staff can add notes, tag them (general/complaint/preference/followup). Notes show author, timestamp, and tag. Pin important notes. Searchable. Connected to order notes — show order-specific notes in customer timeline too. Unified view of all interactions.",
    "passes": false
  },
  {
    "id": "task-130",
    "title": "Create customer communication history",
    "description": "On customer detail page, show all communications — SMS, emails, notifications sent. Aggregated from multiple tables. Shows message content, date, delivery status, channel. Helps track full customer relationship. Links to related orders where applicable. Filter by channel and date.",
    "passes": false
  },
  {
    "id": "task-131",
    "title": "Create customer merge tool",
    "description": "Create src/components/admin/customers/CustomerMerge.tsx — merge duplicate customer records. Select primary record, merge secondary into it. Combines order history, payment history, notes, tags. Deduplicates addresses. Updates all order references to point to primary customer. Logs merge to activity_log. Shows preview before merge.",
    "passes": false
  },
  {
    "id": "task-132",
    "title": "Create customer quick view in order creation",
    "description": "When selecting a customer during order creation, show a quick view card — customer name, phone, email, LTV, order count, last order date, segment badge, tags, preferred address. Helps staff understand customer context while creating orders. Clicking customer name opens full detail in DetailPanel without navigating away.",
    "passes": false
  },
  {
    "id": "task-133",
    "title": "Create customer search with typeahead",
    "description": "Create src/components/admin/customers/CustomerSearch.tsx — typeahead search component used in order creation, customer list, and global search. Searches name, phone, email. Shows results with customer info and segment badge. Debounced 300ms. Highlights matching text. Recent searches cached. Used across multiple modules wherever customer selection needed.",
    "passes": false
  },
  {
    "id": "task-134",
    "title": "Create customer preferred products",
    "description": "On customer detail page, show frequently ordered products based on order history. Show product name, times ordered, last ordered date, total quantity. Clickable to product detail. Useful for staff recommendations during order creation. Show \"Favorites\" section when selecting products for this customer's order.",
    "passes": false
  },
  {
    "id": "task-135",
    "title": "Create customer credit/balance system",
    "description": "Add credit balance to customer records. Create src/hooks/useCustomerCredit.ts — addCredit, deductCredit, getBalance. Credits applied during order payment. Credit history log. Refunds can be issued as credit. Show balance on customer detail and during order checkout. Negative balance = outstanding debt. Connects customer, payment, and order modules.",
    "passes": false
  },
  {
    "id": "task-136",
    "title": "Create Supabase migration for customer_credits table",
    "description": "Create supabase/migrations/add_customer_credits.sql. Columns — id uuid primary key, tenant_id uuid not null, customer_id uuid not null, amount decimal not null, type text (credit/debit), reason text, reference_type text, reference_id uuid, balance_after decimal, user_id uuid, created_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-137",
    "title": "Create customer import from CSV",
    "description": "Create src/components/admin/customers/CustomerImport.tsx — upload CSV with customer data. Parse and validate name, phone, email, address. Duplicate detection by phone/email. Show preview with matched existing customers. Options — skip duplicates, merge, overwrite. Import results summary. Log action. Connects to customer search for deduplication.",
    "passes": false
  },
  {
    "id": "task-138",
    "title": "Create customer export with order data",
    "description": "Export customer list with enriched data — LTV, order count, avg order value, last order date, segment, tags, total paid, outstanding balance. CSV and JSON. Column selection. Filter by segment or tags before export. Use useExport hook. Log export to activity_log.",
    "passes": false
  },
  {
    "id": "task-139",
    "title": "Create customer activity feed",
    "description": "Create src/components/admin/customers/CustomerActivityFeed.tsx — shows all activity for a customer across all modules. Orders placed, payments made, deliveries received, menu interactions, communications received, notes added, credit changes. Unified chronological feed. Each entry links to related entity. Paginated. Filter by activity type.",
    "passes": false
  },
  {
    "id": "task-140",
    "title": "Create customer detail page with delivery map",
    "description": "On customer detail page, show map with customer address and delivery zone. If multiple addresses, show all with labels. Show delivery route from closest hub. Estimated delivery time. Previous delivery routes. Uses Google Maps or similar via existing map component. Connects customer location to delivery planning.",
    "passes": false
  },
  {
    "id": "task-141",
    "title": "Create customer auto-segment on order completion",
    "description": "After an order completes, recalculate customer segment. If customer crossed VIP threshold, update segment and notify admin. If customer was at_risk and placed new order, update to active. Trigger via eventBus order_completed event. Auto-apply segment-specific tags. Update customer record.",
    "passes": false
  },
  {
    "id": "task-142",
    "title": "Create customer block/flag system",
    "description": "Ability to flag or block customers. Flagged customers show warning banner when creating orders. Blocked customers prevented from ordering via storefront. Flag reasons — payment issues, compliance, fraud, abuse. Flag visible across all modules. Activity log tracks flag changes. Admin-only action via usePermissions.",
    "passes": false
  },
  {
    "id": "task-143",
    "title": "Create customer group/organization support",
    "description": "Create organization/group concept. Multiple customers can belong to one organization. Organization has its own profile — name, address, billing info. Orders can be placed under organization. Group pricing rules. Organization-level LTV and analytics. Useful for B2B cannabis wholesale relationships.",
    "passes": false
  },
  {
    "id": "task-144",
    "title": "Create customer loyalty points system",
    "description": "Create src/hooks/useCustomerLoyalty.ts — points-based loyalty system. Earn points on purchases (configurable rate per tenant). Redeem points for discounts on future orders. Points balance on customer detail. Points history log. Tier system — bronze/silver/gold based on points. Tier benefits configurable. Connects orders, payments, and customer modules.",
    "passes": false
  },
  {
    "id": "task-145",
    "title": "Create Supabase migration for loyalty_points table",
    "description": "Create supabase/migrations/add_loyalty_points.sql. Columns — id uuid primary key, tenant_id uuid not null, customer_id uuid not null, points integer not null, type text (earned/redeemed/adjusted/expired), reference_type text, reference_id uuid, balance_after integer, created_at timestamptz. RLS by tenant_id. Index customer_id.",
    "passes": false
  },
  {
    "id": "task-146",
    "title": "Create customer special pricing rules",
    "description": "Create src/components/admin/customers/SpecialPricing.tsx — set customer-specific or group-specific pricing. Override product prices for specific customers or customer groups. Percentage discount or fixed price. Date range for promotions. Show special pricing in order creation when customer selected. Stored in customer_pricing table. Applied automatically.",
    "passes": false
  },
  {
    "id": "task-147",
    "title": "Create Supabase migration for customer_pricing table",
    "description": "Create supabase/migrations/add_customer_pricing.sql. Columns — id uuid primary key, tenant_id uuid, customer_id uuid, customer_group_id uuid, product_id uuid, discount_type text (percentage/fixed), discount_value decimal, start_date date, end_date date, is_active boolean default true. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-148",
    "title": "Create customer dashboard overview",
    "description": "Create src/pages/admin/CustomerDashboard.tsx — overview page for customer module. Stats cards — total customers, new this week, active percentage, average LTV, churn rate. Segment distribution pie chart. Top customers by LTV table. Recent customer activity feed. Customer growth trend line chart. Quick actions — add customer, import, export.",
    "passes": false
  },
  {
    "id": "task-149",
    "title": "Create customer detail page related entities",
    "description": "Add RelatedEntities panel to customer detail page using useRelatedEntities hook. Show recent orders, active deliveries, outstanding payments, applicable special pricing, loyalty tier, communication preferences, associated organization, saved menus. Each section links to respective module.",
    "passes": false
  },
  {
    "id": "task-150",
    "title": "Create customer re-engagement automation",
    "description": "Create src/components/admin/customers/ReEngagement.tsx — view at-risk and churned customers with suggested re-engagement actions. One-click to create promotional offer, send message, or add note. Show days since last order, previous order frequency, and what they used to buy. Helps proactively manage customer relationships.",
    "passes": false
  },
  {
    "id": "task-151",
    "title": "Create customer detail compliance verification",
    "description": "For cannabis compliance, customer detail page shows verification status — age verified, ID on file, purchase limits checked, delivery zone validated. Red flags for missing compliance data. Block order creation if required compliance missing. Configurable per tenant's jurisdiction requirements.",
    "passes": false
  },
  {
    "id": "task-152",
    "title": "Create vendor detail page with product catalog",
    "description": "On vendor detail page, show all products sourced from this vendor. DataTable with product name, SKU, price, current stock, stock status. Clickable to product detail. Total product count and total stock value from this vendor. Filter by category and stock status. Quick add product from vendor page.",
    "passes": false
  },
  {
    "id": "task-153",
    "title": "Create vendor detail page with order history",
    "description": "On vendor detail page, show purchase order history. All purchase orders to this vendor. Columns — PO number, date, total, status, items count, delivery date. Links to PO detail. Calculate total spent with this vendor all-time and this month.",
    "passes": false
  },
  {
    "id": "task-154",
    "title": "Create purchase order management page",
    "description": "Create src/pages/admin/PurchaseOrders.tsx — full purchase order management. Create PO linked to vendor, add products with quantities and costs. PO statuses — draft, sent, confirmed, received, cancelled. On receive, update product inventory via inventory sync. PO creates inventory_history entries with reason restock. Connects vendors to inventory.",
    "passes": false
  },
  {
    "id": "task-155",
    "title": "Create Supabase migration for purchase_orders tables",
    "description": "Create supabase/migrations/add_purchase_orders.sql. Table purchase_orders — id uuid, tenant_id uuid, vendor_id uuid, po_number text, status text, subtotal decimal, tax decimal, total decimal, notes text, expected_date date, received_date date, created_by uuid, created_at timestamptz. Table purchase_order_items — id uuid, po_id uuid, product_id uuid, quantity integer, unit_cost decimal, received_quantity integer default 0. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-156",
    "title": "Create purchase order creation from low stock",
    "description": "When viewing low stock alerts, one-click to create purchase order. Pre-fills vendor (from product's vendor), product, suggested quantity (from reorder settings). Multiple low stock items from same vendor grouped into one PO. Creates draft PO for review before sending. Directly connects inventory alerts to vendor ordering.",
    "passes": false
  },
  {
    "id": "task-157",
    "title": "Create purchase order receiving workflow",
    "description": "Create src/components/admin/vendors/POReceiving.tsx — workflow for receiving a purchase order delivery. Scan or enter products received. Compare received quantities vs ordered. Flag discrepancies. On confirm receive, increment inventory for each item. Log to inventory_history with reason restock and reference_id = PO id. Update PO status to received.",
    "passes": false
  },
  {
    "id": "task-158",
    "title": "Create vendor payment tracking",
    "description": "On vendor detail page, track payments made to vendor. Link payments to purchase orders. Show outstanding balance per vendor. Payment status on PO list. Mark PO as paid with payment date and method. Dashboard shows total vendor payables. Connects vendor module to financial tracking.",
    "passes": false
  },
  {
    "id": "task-159",
    "title": "Create vendor performance metrics",
    "description": "Create src/hooks/useVendorMetrics.ts — calculates vendor performance. Metrics — on-time delivery rate, order accuracy rate, average lead time, total spend, product quality (from returns/complaints), response time. Show on vendor detail page as stats cards. Compare vendors on analytics page. Used for vendor selection recommendations.",
    "passes": false
  },
  {
    "id": "task-160",
    "title": "Create vendor contact management",
    "description": "On vendor detail page, manage multiple contacts per vendor. Contact fields — name, role, phone, email, is_primary. Primary contact auto-selected for PO communications. Quick actions — call, email, copy number. Contact history log. Multiple contacts for different departments (sales, billing, logistics).",
    "passes": false
  },
  {
    "id": "task-161",
    "title": "Create vendor compliance tracking",
    "description": "For cannabis vendors, track compliance — license number, license expiration, license type, approved product categories, state/jurisdiction. Red warning when license approaching expiration. Block PO creation for expired licenses. Link to compliance module. Required compliance docs upload. Audit trail for compliance changes.",
    "passes": false
  },
  {
    "id": "task-162",
    "title": "Create vendor catalog sync",
    "description": "Create src/components/admin/vendors/CatalogSync.tsx — ability to import or sync vendor's product catalog. Upload vendor catalog CSV. Match to existing products. Identify new products to add. Price comparison — vendor price vs current selling price. Margin calculation. Bulk update product costs from vendor catalog. Schedule periodic sync.",
    "passes": false
  },
  {
    "id": "task-163",
    "title": "Create vendor rating and review system",
    "description": "Internal vendor rating system. Rate vendors on 5 dimensions — price, quality, reliability, communication, compliance. Aggregate score displayed on vendor card and detail. Ratings linked to specific POs. History of ratings over time. Useful for deciding which vendors to prioritize. Only visible to admin staff.",
    "passes": false
  },
  {
    "id": "task-164",
    "title": "Create vendor dashboard overview",
    "description": "Create src/pages/admin/VendorDashboard.tsx — overview of vendor module. Stats cards — total vendors, active POs, total outstanding payables, on-time delivery rate. Top vendors by spend table. Recent PO activity feed. Vendor distribution by category chart. Quick actions — add vendor, create PO, view pending deliveries.",
    "passes": false
  },
  {
    "id": "task-165",
    "title": "Create vendor auto-PO suggestions",
    "description": "Based on inventory forecasting, auto-generate PO suggestions. When multiple products from same vendor approaching reorder point, suggest consolidated PO. Show estimated cost, recommended quantities based on sales velocity. One-click to create draft PO. Daily check triggered by Supabase Edge Function or dashboard load.",
    "passes": false
  },
  {
    "id": "task-166",
    "title": "Create vendor payment terms tracking",
    "description": "Store payment terms per vendor — net 15/30/60, COD, prepaid. Auto-calculate payment due dates on POs. Show overdue payments on dashboard. Aging report for outstanding payables. Payment term compliance tracking. Alert when payment approaching due date. Connects vendor payments to financial management.",
    "passes": false
  },
  {
    "id": "task-167",
    "title": "Create vendor product price history",
    "description": "Track vendor pricing over time for each product. When cost price changes on PO, log to vendor_price_history. Show price trend chart on product detail (vendor cost tab). Alert when vendor raises prices above threshold. Useful for negotiation. Connects vendor module to product cost tracking and margin analysis.",
    "passes": false
  },
  {
    "id": "task-168",
    "title": "Create vendor communication log",
    "description": "On vendor detail page, log all communications. Staff can add notes about calls, emails, meetings. Attach relevant POs to communication entries. Timeline view. Useful for team coordination — everyone sees what was discussed with vendor. Searchable. Filter by communication type and date.",
    "passes": false
  },
  {
    "id": "task-169",
    "title": "Create vendor document management",
    "description": "On vendor detail page, upload and manage documents — contracts, licenses, lab results, certificates, pricing sheets. Documents categorized by type. Expiration dates tracked. Notifications before expiration. Documents linked to vendor and accessible from product compliance checks. Supabase Storage with tenant path.",
    "passes": false
  },
  {
    "id": "task-170",
    "title": "Create vendor bulk import",
    "description": "Create src/components/admin/vendors/VendorImport.tsx — import multiple vendors from CSV. Fields — name, contact name, email, phone, address, license number. Duplicate detection by name and license. Preview with validation errors. Import results summary. Useful when onboarding multiple vendors at once.",
    "passes": false
  },
  {
    "id": "task-171",
    "title": "Create vendor-to-product quick link",
    "description": "When viewing a vendor, quick action to add a new product sourced from this vendor. Pre-fills vendor_id. Also, from product creation form, vendor dropdown shows all vendors with their product counts and ratings. Vendor selection auto-populates vendor-specific fields like lead time and payment terms.",
    "passes": false
  },
  {
    "id": "task-172",
    "title": "Create menu builder product selector",
    "description": "In the menu/disposable menu builder, product selection connects to live inventory. Show stock status badge next to each product. Out-of-stock products grayed out. Low-stock products show warning. Product price pulled from product record but overridable per menu. Category filtering matches product categories. Search within product catalog.",
    "passes": false
  },
  {
    "id": "task-173",
    "title": "Create menu live inventory sync",
    "description": "When a menu is active and a product goes out of stock, automatically hide or gray out that product on the menu. Use Supabase realtime subscription on products table. When stock is restored, product becomes available again. Show notification to admin when products auto-hidden. Prevents customers from ordering unavailable items.",
    "passes": false
  },
  {
    "id": "task-174",
    "title": "Create menu order flow to admin orders",
    "description": "When a customer places an order through a disposable menu, the order must appear immediately in the admin orders panel. Order should include source=disposable_menu and menu_id reference. All order processing features work the same — inventory decrement, payment tracking, delivery assignment. Realtime subscription ensures instant appearance.",
    "passes": false
  },
  {
    "id": "task-175",
    "title": "Create menu order notifications to admin",
    "description": "When an order comes through a disposable menu, send immediate notification to admin. Notification includes customer name/phone, items ordered, total, delivery address if applicable. Notification bell shows unread count. Sound notification option. Push notification if PWA installed. Uses useNotificationDispatcher with event order_created.",
    "passes": false
  },
  {
    "id": "task-176",
    "title": "Create menu analytics dashboard",
    "description": "Create src/components/admin/menus/MenuAnalytics.tsx — analytics per menu. Views count, unique visitors, add-to-cart rate, checkout rate, conversion funnel, popular products on this menu, average order value from this menu, revenue generated. Date range selector. Compare menus. Data from orders filtered by menu_id. Charts using recharts.",
    "passes": false
  },
  {
    "id": "task-177",
    "title": "Create menu customer tracking",
    "description": "Track customer interactions with menus. When a customer visits a menu, opens product, adds to cart, starts checkout, completes order — log each step. Create menu_events table. Use for conversion funnel analysis. Link events to customer record if identified. Anonymous tracking for unidentified visitors. Session-based grouping.",
    "passes": false
  },
  {
    "id": "task-178",
    "title": "Create Supabase migration for menu_events table",
    "description": "Create supabase/migrations/add_menu_events.sql. Columns — id uuid primary key, tenant_id uuid, menu_id uuid, session_id text, customer_id uuid nullable, event_type text (view/product_view/add_to_cart/checkout_start/order_complete), product_id uuid nullable, metadata jsonb, created_at timestamptz. RLS by tenant_id. Index menu_id, session_id.",
    "passes": false
  },
  {
    "id": "task-179",
    "title": "Create menu product ordering with drag-drop",
    "description": "In menu builder, allow reordering products via drag-and-drop. Product order saved per menu. Categories also reorderable. Changes preview in real-time. Save position to menu_products junction table with sort_order column. Product arrangement independent per menu — same product can have different positions on different menus.",
    "passes": false
  },
  {
    "id": "task-180",
    "title": "Create menu scheduling system",
    "description": "Create src/components/admin/menus/MenuScheduler.tsx — schedule menus to auto-activate/deactivate. Set start and end dates/times. Recurring schedules (e.g. every Friday 5pm - Sunday midnight). Multiple schedules per menu. Calendar view of active menus. Conflicts detection — warn if products overlap across simultaneously active menus. Uses Supabase Edge Function for auto-activation.",
    "passes": false
  },
  {
    "id": "task-181",
    "title": "Create Supabase migration for menu_schedules table",
    "description": "Create supabase/migrations/add_menu_schedules.sql. Columns — id uuid primary key, tenant_id uuid, menu_id uuid, start_time timestamptz, end_time timestamptz, is_recurring boolean default false, recurrence_rule text (cron-like), is_active boolean default true, created_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-182",
    "title": "Create menu theme customization",
    "description": "Create src/components/admin/menus/MenuTheme.tsx — customize menu appearance per tenant. Colors (primary, secondary, background, text), logo upload, font selection, layout style (grid/list), header image, footer text, custom CSS. Preview in real-time. Save theme to menu record or tenant_branding. Apply theme when rendering disposable menu.",
    "passes": false
  },
  {
    "id": "task-183",
    "title": "Create menu share and distribution",
    "description": "Create src/components/admin/menus/MenuShare.tsx — tools for distributing disposable menus. Generate shareable link, QR code, embed code. Track link clicks and conversions per distribution channel. UTM parameter support for tracking. Copy link button with toast. Bulk generate QR codes for all active menus. Download QR as PNG.",
    "passes": false
  },
  {
    "id": "task-184",
    "title": "Create menu product availability rules",
    "description": "Set product availability rules per menu. Rules — available only certain hours, available only certain days, limited quantity per menu session, bundle-only (not sold individually on this menu). Rules engine evaluates when customer views menu. Unavailable products hidden or shown as unavailable. Connects to scheduling module.",
    "passes": false
  },
  {
    "id": "task-185",
    "title": "Create storefront to admin order real-time sync",
    "description": "Verify and enhance that orders placed through the main storefront appear instantly in admin. Use Supabase realtime subscriptions. Order includes source=storefront. Admin order list auto-refreshes when new storefront order arrives. If admin has order list open, new order slides in at top with highlight animation. Toast notification.",
    "passes": false
  },
  {
    "id": "task-186",
    "title": "Create storefront product sync from admin",
    "description": "When admin updates a product (price, name, description, image, stock), changes reflect on storefront immediately. Use eventBus product_updated event. Storefront uses TanStack Query with realtime invalidation. No manual publish step needed. Audit log tracks what changed and when. Show sync status indicator on product pages.",
    "passes": false
  },
  {
    "id": "task-187",
    "title": "Create storefront customer account link",
    "description": "When a customer creates an account on storefront, record appears in admin customer list. Customer's storefront browsing history, wishlist, and preferences accessible from admin. Orders placed via storefront linked to customer profile. Customer can view their order history on storefront — pulls from same orders table. Unified customer record.",
    "passes": false
  },
  {
    "id": "task-188",
    "title": "Create storefront cart abandonment tracking",
    "description": "Track carts that don't complete checkout. Store abandoned cart data — products, quantities, customer (if identified), timestamp, menu/storefront source. Show abandoned carts in admin dashboard. Auto-generate follow-up suggestion for identified customers. Calculate abandonment rate by menu. Connect to customer re-engagement module.",
    "passes": false
  },
  {
    "id": "task-189",
    "title": "Create Supabase migration for abandoned_carts table",
    "description": "Create supabase/migrations/add_abandoned_carts.sql. Columns — id uuid primary key, tenant_id uuid, session_id text, customer_id uuid nullable, menu_id uuid nullable, cart_items jsonb, total_value decimal, created_at timestamptz, recovered boolean default false, recovered_order_id uuid nullable. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-190",
    "title": "Create menu compliance badge display",
    "description": "On each menu, display required compliance information. For cannabis — license number, lab test badges, THC/CBD content. Configurable per tenant's jurisdiction. Required fields enforced before menu can be published. Non-compliant products flagged and optionally hidden. Compliance data pulled from product compliance records.",
    "passes": false
  },
  {
    "id": "task-191",
    "title": "Create menu A/B testing framework",
    "description": "Create src/components/admin/menus/MenuABTest.tsx — A/B test different menu configurations. Create variant menus with different product orders, pricing, or layouts. Traffic split percentage. Track conversion rate per variant. Statistical significance calculator. Winner selection. Apply winning variant. Connects to menu analytics.",
    "passes": false
  },
  {
    "id": "task-192",
    "title": "Create menu feedback collection",
    "description": "Optional feedback form on menus post-order. Simple rating (1-5) and comment. Feedback linked to order and customer. Show feedback in admin dashboard. Aggregate rating per menu. Recent feedback list on menu detail page. Useful for iterating on menu design. Connects customer experience to menu optimization.",
    "passes": false
  },
  {
    "id": "task-193",
    "title": "Create Supabase migration for menu_feedback table",
    "description": "Create supabase/migrations/add_menu_feedback.sql. Columns — id uuid primary key, tenant_id uuid, menu_id uuid, order_id uuid, customer_id uuid nullable, rating integer check (1-5), comment text, created_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-194",
    "title": "Create menu template library",
    "description": "Create src/components/admin/menus/MenuTemplates.tsx — save menu configurations as templates. Templates include product selection, layout, theme, availability rules. Create new menu from template. Share templates across tenant. Default templates for common use cases (daily special, weekend menu, wholesale catalog). Template versioning.",
    "passes": false
  },
  {
    "id": "task-195",
    "title": "Create menu deep link to specific products",
    "description": "Generate deep links to specific products on a menu. URL includes menu ID and product ID. When opened, menu scrolls to and highlights the product. Useful for promotions — share link to a specific product. Track deep link clicks. QR code generation per product-menu combination.",
    "passes": false
  },
  {
    "id": "task-196",
    "title": "Create storefront-admin inventory sync indicator",
    "description": "In admin, show indicator that storefront inventory display is in sync. If there's a lag (rare), show warning. Last sync timestamp. Manual sync button for force refresh. Monitors Supabase realtime connection health. Shows in admin header near sync status indicator.",
    "passes": false
  },
  {
    "id": "task-197",
    "title": "Create menu performance comparison report",
    "description": "Create src/components/admin/menus/MenuComparison.tsx — compare 2-3 menus side by side. Metrics — views, orders, revenue, conversion rate, avg order value, top products. Date range selector. Highlight winner per metric. Export comparison. Useful for deciding which menu format works best. Data from menu_events and orders.",
    "passes": false
  },
  {
    "id": "task-198",
    "title": "Create menu product recommendation engine",
    "description": "On menu builder, suggest products to add based on — popular products from other menus, products frequently bought together, high-margin products, new arrivals. Recommendation section in product selector. Based on order analytics and product performance. Helps optimize menu for maximum revenue.",
    "passes": false
  },
  {
    "id": "task-199",
    "title": "Create storefront announcement bar",
    "description": "Create src/components/admin/storefront/AnnouncementBar.tsx — admin-manageable announcement bar on storefront. Set text, link, background color, schedule. Multiple announcements rotate. Dismiss tracking per session. Used for promotions, new product launches, compliance notices. Managed from admin, displayed on storefront. Real-time updates.",
    "passes": false
  },
  {
    "id": "task-200",
    "title": "Create menu expiration and auto-archive",
    "description": "Menus with end dates auto-deactivate and move to archive when expired. Archived menus preserve analytics data. Reactivation with one click (updates link, resets schedule). Auto-notify admin when menu expires. Dashboard shows expiring-soon menus. Connects scheduling to menu lifecycle management.",
    "passes": false
  },
  {
    "id": "task-201",
    "title": "Create storefront SEO settings in admin",
    "description": "Create src/components/admin/storefront/SEOSettings.tsx — manage storefront SEO from admin. Set page title, meta description, social share image, keywords. Preview how links appear on social media. Auto-generate sitemap. Per-product SEO overrides. Applies to storefront and menu pages. Saves to tenant_settings.",
    "passes": false
  },
  {
    "id": "task-202",
    "title": "Create delivery management dashboard",
    "description": "Create src/pages/admin/DeliveryDashboard.tsx — overview of all deliveries. Stats — active deliveries, completed today, average delivery time, on-time rate. Map showing active delivery locations. Runner status list. Pending assignments queue. Delivery timeline for today. Quick assign action. Uses multiple interconnected queries.",
    "passes": false
  },
  {
    "id": "task-203",
    "title": "Create delivery-order two-way sync",
    "description": "Delivery status changes reflect on order immediately and vice versa. When delivery marked in_transit, order status updates to out_for_delivery. When delivery completed, order status updates to delivered. When order cancelled, delivery auto-cancelled. Bidirectional sync via eventBus. Both modules always show consistent status.",
    "passes": false
  },
  {
    "id": "task-204",
    "title": "Create delivery runner assignment from orders",
    "description": "On order detail page, assign delivery runner. Show available runners with current load (active deliveries count). Auto-suggest best runner based on proximity to delivery address and current route. Assignment creates delivery record linked to order and runner. Notification sent to runner. Updates order status to assigned.",
    "passes": false
  },
  {
    "id": "task-205",
    "title": "Create delivery route optimization",
    "description": "Create src/hooks/useRouteOptimizer.ts — given multiple pending deliveries, suggest optimal route. Consider delivery addresses, time windows, runner location, package sizes. Show route on map. Drag-to-reorder stops. Estimated time per stop. Total route duration. One-click to assign all stops to runner. Connects delivery to map/location services.",
    "passes": false
  },
  {
    "id": "task-206",
    "title": "Create delivery tracking page for customers",
    "description": "Create a customer-facing delivery tracking page. Order number and phone lookup. Shows delivery status, runner name, estimated time, live location (if enabled). Status timeline — confirmed, picked up, in transit, nearby, delivered. Auto-refresh with Supabase realtime. Accessible from order confirmation page and SMS link.",
    "passes": false
  },
  {
    "id": "task-207",
    "title": "Create delivery runner mobile view",
    "description": "Create src/pages/mobile/RunnerView.tsx — mobile-optimized view for delivery runners. Shows assigned deliveries in route order. Each delivery shows customer name, address, items, special instructions. Navigation button opens maps app. Status update buttons — picked up, in transit, delivered. Photo proof of delivery upload. Offline support.",
    "passes": false
  },
  {
    "id": "task-208",
    "title": "Create delivery notification chain",
    "description": "Automated notification chain for deliveries. On assignment → notify runner. On pickup → notify customer \"Your order is on its way\". On nearby (geo-proximity) → notify customer \"Your delivery is almost there\". On delivered → notify customer and admin. All notifications via useNotificationDispatcher. SMS option for customer notifications.",
    "passes": false
  },
  {
    "id": "task-209",
    "title": "Create delivery proof of delivery",
    "description": "Create src/components/admin/delivery/ProofOfDelivery.tsx — runner captures proof of delivery. Photo upload, customer signature (canvas), recipient name, delivery notes. Stored in Supabase Storage linked to delivery and order. Viewable on order detail page. Required for compliance in cannabis delivery. Generates delivery receipt.",
    "passes": false
  },
  {
    "id": "task-210",
    "title": "Create Supabase migration for delivery_proofs table",
    "description": "Create supabase/migrations/add_delivery_proofs.sql. Columns — id uuid primary key, tenant_id uuid, delivery_id uuid, order_id uuid, photo_url text, signature_url text, recipient_name text, notes text, location_lat decimal, location_lng decimal, captured_at timestamptz, created_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-211",
    "title": "Create delivery zone management",
    "description": "Create src/pages/admin/DeliveryZones.tsx — define delivery zones on map. Draw polygons for zones. Set delivery fee per zone. Set minimum order per zone. Set delivery hours per zone. Validate customer addresses against zones during order creation and storefront checkout. Restrict ordering from outside zones. Zone data stored in tenant settings or zones table.",
    "passes": false
  },
  {
    "id": "task-212",
    "title": "Create delivery fee calculation",
    "description": "Create src/hooks/useDeliveryFee.ts — calculates delivery fee based on zone, order total, distance, and promotions. Free delivery above configurable threshold. Zone-based flat rates. Distance-based variable rates. Apply promo codes for free delivery. Show fee breakdown on order and storefront checkout. Connects order pricing to delivery zones.",
    "passes": false
  },
  {
    "id": "task-213",
    "title": "Create delivery analytics",
    "description": "Create src/components/admin/delivery/DeliveryAnalytics.tsx — delivery performance metrics. Average delivery time by zone, by runner, by day of week. On-time delivery rate trend chart. Deliveries per runner per day. Failed delivery rate and reasons. Revenue from delivery fees. Busiest delivery hours heatmap. Date range selector. Export report.",
    "passes": false
  },
  {
    "id": "task-214",
    "title": "Create delivery scheduling",
    "description": "Create src/components/admin/delivery/DeliveryScheduler.tsx — schedule deliveries for specific time slots. Define available time slots per day. Customer selects slot during checkout. Show slot capacity (max deliveries per slot). Block full slots. Calendar view of upcoming scheduled deliveries. Connects checkout flow to delivery capacity.",
    "passes": false
  },
  {
    "id": "task-215",
    "title": "Create delivery exception handling",
    "description": "Create src/components/admin/delivery/DeliveryExceptions.tsx — handle delivery failures. Reasons — customer not home, wrong address, refused delivery, access issue. Log exception with reason and photo. Auto-reroute or reschedule. Notify admin and customer. Create return-to-store process. Update order status accordingly. Track exception rate.",
    "passes": false
  },
  {
    "id": "task-216",
    "title": "Create delivery runner performance tracking",
    "description": "Create src/hooks/useRunnerMetrics.ts — track runner performance. Metrics — deliveries completed, average delivery time, on-time rate, customer ratings, exceptions count, distance covered. Show on runner detail page. Weekly performance report. Runner leaderboard on delivery dashboard. Used for runner management and optimization.",
    "passes": false
  },
  {
    "id": "task-217",
    "title": "Create delivery compliance checks",
    "description": "For cannabis delivery, enforce compliance checks. Age verification required before delivery. Check customer ID on file. Delivery address in licensed zone. Time of day restrictions. Maximum quantity limits. Compliance checklist for runner before completing delivery. Block delivery completion if checks fail. Audit log of all compliance checks.",
    "passes": false
  },
  {
    "id": "task-218",
    "title": "Create delivery batch creation from orders",
    "description": "Create src/components/admin/delivery/BatchCreate.tsx — select multiple confirmed orders and create deliveries in batch. Auto-group orders by zone. Suggest runners for each zone group. Create delivery records for all selected orders at once. Progress indicator. Success summary with any failures. Massive time saver for operations.",
    "passes": false
  },
  {
    "id": "task-219",
    "title": "Create delivery ETAs on order list",
    "description": "On the admin orders list, show delivery ETA column for orders in delivery. Calculate based on runner's current location, remaining stops, and historical delivery times. Update in real-time. Overdue deliveries highlighted in red. Clicking ETA opens delivery detail in panel. Connects order view to real-time delivery tracking.",
    "passes": false
  },
  {
    "id": "task-220",
    "title": "Create delivery cost tracking and P&L",
    "description": "Track delivery costs per order — runner pay, fuel estimate, time cost. Compare to delivery fee collected. Show delivery P&L on order detail and delivery analytics. Profitable vs unprofitable deliveries breakdown. Route optimization suggestions for unprofitable zones. Connects delivery to financial analytics.",
    "passes": false
  },
  {
    "id": "task-221",
    "title": "Create delivery customer rating",
    "description": "After delivery, customer can rate experience (1-5 stars) and leave comment. Rating linked to delivery, order, runner, and customer records. Show average rating per runner. Recent reviews on delivery dashboard. Low rating triggers admin notification. Used in runner performance tracking and customer feedback loop.",
    "passes": false
  },
  {
    "id": "task-222",
    "title": "Create unified analytics dashboard",
    "description": "Create src/pages/admin/AnalyticsDashboard.tsx — single page aggregating analytics from all modules. Revenue chart (daily/weekly/monthly), order volume, customer growth, inventory turnover, delivery performance, menu conversion rates. All data filtered by tenant_id. Date range picker affects all charts. Summary stats cards at top. Uses recharts for all visualizations.",
    "passes": false
  },
  {
    "id": "task-223",
    "title": "Create revenue analytics component",
    "description": "Create src/components/admin/analytics/RevenueAnalytics.tsx — detailed revenue analysis. Total revenue, revenue by product, by category, by customer segment, by order source (admin/storefront/menu). Revenue trend chart. Day-of-week heatmap. Hour-of-day distribution. Compare current period to previous period. Revenue per customer metric.",
    "passes": false
  },
  {
    "id": "task-224",
    "title": "Create product performance analytics",
    "description": "Create src/components/admin/analytics/ProductPerformance.tsx — which products drive business. Top sellers by revenue and units. Slow movers list. Product margin analysis. Stock turn rate. Products approaching stockout. Category performance comparison. Product discovery — new products vs established. Uses order and inventory data.",
    "passes": false
  },
  {
    "id": "task-225",
    "title": "Create customer analytics component",
    "description": "Create src/components/admin/analytics/CustomerAnalytics.tsx — customer health metrics. New vs returning customer ratio. Customer acquisition trend. Average LTV by segment. Retention rate (cohort analysis). Top customers table. Customer concentration risk (top 10% revenue share). Churn prediction. Uses customer, order, and payment data.",
    "passes": false
  },
  {
    "id": "task-226",
    "title": "Create sales funnel analytics",
    "description": "Create src/components/admin/analytics/SalesFunnel.tsx — full funnel from menu view to delivery. Steps — menu views, product views, add to cart, checkout started, order placed, payment received, delivery completed. Drop-off rates between each step. Funnel by menu and storefront. Uses menu_events, abandoned_carts, orders, payments, deliveries data.",
    "passes": false
  },
  {
    "id": "task-227",
    "title": "Create inventory analytics component",
    "description": "Create src/components/admin/analytics/InventoryAnalytics.tsx — inventory health overview. Stock value over time. Turn rate by category. Dead stock identification. Reorder accuracy (were reorders timely). Stockout incidents count and revenue impact estimate. Inventory efficiency score. Uses inventory_history and order data.",
    "passes": false
  },
  {
    "id": "task-228",
    "title": "Create delivery analytics component",
    "description": "Create src/components/admin/analytics/DeliveryMetrics.tsx — delivery performance deep dive. Average delivery time trend. On-time rate by zone and runner. Failed delivery analysis. Delivery cost vs revenue. Peak hours chart. Zone performance comparison. Route efficiency score. Uses delivery and order data with location data.",
    "passes": false
  },
  {
    "id": "task-229",
    "title": "Create vendor analytics component",
    "description": "Create src/components/admin/analytics/VendorAnalytics.tsx — vendor relationship insights. Spend by vendor pie chart. Lead time trends. Price change impact on margins. Vendor reliability scores. Purchase order fulfillment accuracy. Cost comparison for products available from multiple vendors. Uses PO, product, and inventory data.",
    "passes": false
  },
  {
    "id": "task-230",
    "title": "Create financial overview analytics",
    "description": "Create src/components/admin/analytics/FinancialOverview.tsx — P&L style overview. Revenue, COGS (from vendor costs), gross margin, delivery costs, net margin. Cash flow projection based on outstanding invoices and payables. Compare periods. Trend charts. Export financial summary report. Aggregates data from orders, payments, vendors, delivery costs.",
    "passes": false
  },
  {
    "id": "task-231",
    "title": "Create custom report builder",
    "description": "Create src/pages/admin/ReportBuilder.tsx — drag-and-drop report builder. Select data sources (orders, products, customers, deliveries, inventory). Choose metrics and dimensions. Apply filters. Preview report. Save as template. Schedule automated delivery via email. Export PDF/CSV. Connects all modules through a unified reporting interface.",
    "passes": false
  },
  {
    "id": "task-232",
    "title": "Create analytics date range context provider",
    "description": "Create src/contexts/AnalyticsDateContext.tsx — shared date range state for analytics. When user changes date range on any analytics component, all components on the page update. Presets — today, 7d, 30d, 90d, custom range. Compare mode (current vs previous period). Persists selection in URL params. All analytics components consume this context.",
    "passes": false
  },
  {
    "id": "task-233",
    "title": "Create analytics data export hub",
    "description": "Create src/components/admin/analytics/ExportHub.tsx — centralized export for all analytics data. Select modules to include, date range, format (CSV/JSON/PDF). Scheduled exports — daily, weekly, monthly automated reports. Email delivery. Export history log. Uses useExport hook with multi-module data aggregation.",
    "passes": false
  },
  {
    "id": "task-234",
    "title": "Create real-time analytics ticker",
    "description": "Create src/components/admin/analytics/RealtimeTicker.tsx — horizontal scrolling ticker on analytics dashboard showing live metrics. Orders in last hour, revenue today, active deliveries, menu views right now. Updates every 10 seconds via lightweight queries. Gives instant pulse of business activity. Subscribes to realtime changes.",
    "passes": false
  },
  {
    "id": "task-235",
    "title": "Create analytics cohort analysis",
    "description": "Create src/components/admin/analytics/CohortAnalysis.tsx — customer cohort retention analysis. Group customers by first order month. Track retention (returning orders) over subsequent months. Heatmap visualization. Identify best and worst performing cohorts. Correlate with marketing or menu changes. Uses customer and order data across months.",
    "passes": false
  },
  {
    "id": "task-236",
    "title": "Create analytics goal tracking",
    "description": "Create src/components/admin/analytics/GoalTracker.tsx — set monthly/weekly goals for key metrics. Goals for revenue, order count, new customers, delivery time. Progress bar for each goal. On-track/behind/ahead indicator. Historical goal achievement. Set goals in settings, track on dashboard. Motivational and connects analytics to business objectives.",
    "passes": false
  },
  {
    "id": "task-237",
    "title": "Create Supabase migration for analytics_goals table",
    "description": "Create supabase/migrations/add_analytics_goals.sql. Columns — id uuid primary key, tenant_id uuid, metric_name text, target_value decimal, period_type text (daily/weekly/monthly), period_start date, period_end date, current_value decimal default 0, created_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-238",
    "title": "Create analytics comparison tools",
    "description": "Create src/hooks/useAnalyticsComparison.ts — compare any two time periods. Returns current period metrics and previous period metrics with percentage change for each. Used across all analytics components. Support custom date ranges. Shows sparklines for trend direction. Green/red indicators for improvement/decline.",
    "passes": false
  },
  {
    "id": "task-239",
    "title": "Create analytics drill-down functionality",
    "description": "In all analytics charts, clicking a data point drills down to underlying records. Click a revenue bar → see orders for that day. Click a product in top sellers → see product detail. Click a customer segment → see customer list filtered to that segment. Uses useEntityNavigation for cross-module navigation. Breadcrumb trail for drill-down path.",
    "passes": false
  },
  {
    "id": "task-240",
    "title": "Create analytics alerts and thresholds",
    "description": "Create src/components/admin/settings/AnalyticsAlerts.tsx — configure alert thresholds for analytics metrics. Alert when daily revenue drops below X, when order count exceeds capacity, when delivery time exceeds Y minutes. Notifications via useNotificationDispatcher. Dashboard shows active alerts. Configurable per metric. Connects analytics to notification module.",
    "passes": false
  },
  {
    "id": "task-241",
    "title": "Create analytics API for external consumption",
    "description": "Create Supabase Edge Function analytics-api that exposes analytics data via authenticated API. Endpoints for revenue, orders, inventory, customers summary. API key authentication per tenant. Rate limited. Documentation page in admin. Useful for integrating with external BI tools. Respects tenant isolation.",
    "passes": false
  },
  {
    "id": "task-242",
    "title": "Create tenant settings hub page",
    "description": "Create src/pages/admin/SettingsHub.tsx — central settings page organized by category. Categories — General (business info), Orders (auto-confirm, SLA targets), Inventory (thresholds, auto-reorder), Delivery (zones, fees, slots), Menus (defaults, themes), Notifications (channels, preferences), Compliance (licenses, requirements), Users (roles, permissions). Each category links to its settings page.",
    "passes": false
  },
  {
    "id": "task-243",
    "title": "Create business profile settings",
    "description": "Create src/components/admin/settings/BusinessProfile.tsx — edit tenant business information. Name, logo, address, phone, email, website, tax ID, license numbers. This data is used across all modules — on receipts, invoices, menus, storefront, compliance docs. Changes propagate to all modules that display business info. Supabase Storage for logo.",
    "passes": false
  },
  {
    "id": "task-244",
    "title": "Create order settings page",
    "description": "Create src/components/admin/settings/OrderSettings.tsx — configure order behavior. Auto-confirm orders (yes/no), default payment method, tax rate, order number prefix, SLA targets (minutes for each stage), auto-assign rules, require customer for orders (yes/no), minimum order amount. Saved to tenant_settings jsonb. Applied across order module.",
    "passes": false
  },
  {
    "id": "task-245",
    "title": "Create inventory settings page",
    "description": "Create src/components/admin/settings/InventorySettings.tsx — configure inventory behavior. Default low stock threshold, critical stock threshold, auto-reorder enabled, reorder lead time buffer, inventory count frequency, barcode scanning enabled. Saved to tenant_settings. Applied by inventory hooks and components.",
    "passes": false
  },
  {
    "id": "task-246",
    "title": "Create delivery settings page",
    "description": "Create src/components/admin/settings/DeliverySettings.tsx — configure delivery behavior. Default delivery fee, free delivery threshold, delivery hours, max deliveries per slot, require proof of delivery, require age verification, allow scheduled deliveries, delivery radius. Saved to tenant_settings. Applied in delivery creation and storefront checkout.",
    "passes": false
  },
  {
    "id": "task-247",
    "title": "Create notification settings page",
    "description": "Create src/components/admin/settings/NotificationSettings.tsx — configure which notifications are enabled. Toggle per notification type — new order, low stock, delivery completed, customer signup, etc. Channel selection per type — in-app, email, SMS. Quiet hours. Admin vs staff notification routing. Saved to tenant_settings. Applied by useNotificationDispatcher.",
    "passes": false
  },
  {
    "id": "task-248",
    "title": "Create user and role management page",
    "description": "Create src/pages/admin/UserManagement.tsx — manage staff users for the tenant. Invite users by email. Assign roles — admin, manager, staff, runner. Custom role creation. Permission matrix per role. Deactivate users. Show last active, login history. Role changes logged to activity_log. Permission changes affect all module access via usePermissions.",
    "passes": false
  },
  {
    "id": "task-249",
    "title": "Create role permission matrix editor",
    "description": "Create src/components/admin/settings/PermissionMatrix.tsx — visual grid of roles vs permissions. Permissions include view/edit/delete for each module (orders, products, customers, etc). Checkbox grid. Pre-defined role templates. Custom roles inherit from templates. Changes apply immediately. Audit log for permission changes. Used by usePermissions hook.",
    "passes": false
  },
  {
    "id": "task-250",
    "title": "Create compliance settings page",
    "description": "Create src/components/admin/settings/ComplianceSettings.tsx — configure compliance requirements for the tenant's jurisdiction. Required fields for products (lab test, THC content, etc), required for customers (age verification, ID), required for delivery (ID check, photo proof), license information, expiration tracking. Non-compliant entities flagged across all modules.",
    "passes": false
  },
  {
    "id": "task-251",
    "title": "Create compliance audit log",
    "description": "Create src/pages/admin/ComplianceAudit.tsx — comprehensive audit trail for all compliance-related actions. Track who verified customer IDs, when lab tests were uploaded, delivery compliance checks performed, license renewals. Filterable by entity type, user, date range. Exportable for regulatory inspection. Connects compliance to activity_log.",
    "passes": false
  },
  {
    "id": "task-252",
    "title": "Create tax configuration settings",
    "description": "Create src/components/admin/settings/TaxSettings.tsx — configure tax rates and rules. Default tax rate, product-specific rates, tax-exempt categories, tax-exempt customers. Tax applied automatically in order creation, storefront checkout, and invoices. Tax collected tracking for reporting. Show tax breakdown on receipts.",
    "passes": false
  },
  {
    "id": "task-253",
    "title": "Create integrations settings page",
    "description": "Create src/pages/admin/Integrations.tsx — manage external integrations. Sections for payment processors, SMS providers, email services, accounting software, POS systems. Each integration shows status (connected/disconnected), last sync, and settings. Connect/disconnect actions. API key management. Webhook URL configuration. Connects admin to external systems.",
    "passes": false
  },
  {
    "id": "task-254",
    "title": "Create webhook management",
    "description": "Create src/components/admin/settings/Webhooks.tsx — configure outgoing webhooks for events. Select events to trigger webhooks (order_created, payment_received, etc). Set URL, headers, secret. Test webhook with sample payload. Webhook delivery log with success/failure. Retry failed webhooks. Connects FloraIQ events to external systems.",
    "passes": false
  },
  {
    "id": "task-255",
    "title": "Create Supabase migration for webhooks table",
    "description": "Create supabase/migrations/add_webhooks.sql. Columns — id uuid primary key, tenant_id uuid, event_type text, url text, headers jsonb, secret text, is_active boolean default true, last_triggered_at timestamptz, failure_count integer default 0. Table webhook_deliveries — id uuid, webhook_id uuid, event_data jsonb, status text, response_code integer, created_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-256",
    "title": "Create audit log viewer",
    "description": "Create src/pages/admin/AuditLog.tsx — view all activity_log entries. Filter by module, action type, user, date range. Search by entity. Show user, action, entity, timestamp, changes (from metadata). Pagination. Export to CSV. Infinite scroll option. Color-coded by action type. This is the single view into all system activity across all modules.",
    "passes": false
  },
  {
    "id": "task-257",
    "title": "Create backup and data export settings",
    "description": "Create src/components/admin/settings/DataManagement.tsx — export all tenant data. Export customers, orders, products, inventory, vendor data as ZIP of CSVs. Data retention settings. Scheduled backups. GDPR compliance — customer data deletion requests. Data export request creates background job. Download link emailed when ready.",
    "passes": false
  },
  {
    "id": "task-258",
    "title": "Create tenant branding settings",
    "description": "Create src/components/admin/settings/BrandingSettings.tsx — customize branding across all customer-facing elements. Primary/secondary colors, logo, favicon, email templates, receipt header/footer, menu default theme, storefront theme. Preview each branded element. Changes apply to menus, storefront, receipts, invoices, and customer communications.",
    "passes": false
  },
  {
    "id": "task-259",
    "title": "Create system health monitoring",
    "description": "Create src/components/admin/settings/SystemHealth.tsx — monitor system connectivity. Check Supabase connection, realtime subscription status, storage access, Edge Function status. Show each service as green/yellow/red. Last check timestamp. Auto-check every 60 seconds. Manual refresh button. Alert when service degraded. Uses useModuleHealth hook.",
    "passes": false
  },
  {
    "id": "task-260",
    "title": "Create feature flags settings",
    "description": "Create src/components/admin/settings/FeatureFlags.tsx — toggle features on/off per tenant. Flags for — loyalty_points_enabled, delivery_tracking_enabled, storefront_enabled, customer_accounts_enabled, recurring_orders_enabled, api_access_enabled. Stored in tenant_settings. Checked by feature gate hook. UI components conditionally render based on flags.",
    "passes": false
  },
  {
    "id": "task-261",
    "title": "Create useFeatureFlag hook",
    "description": "Create src/hooks/useFeatureFlag.ts — checks if a feature flag is enabled for current tenant. Returns boolean. Uses useTenantContext to get tenant settings. Caches flag values. Used across all modules to conditionally render features. Example — if (!useFeatureFlag('loyalty_enabled')) return null in loyalty components. Centralized feature gating.",
    "passes": false
  },
  {
    "id": "task-262",
    "title": "Create unified search results page",
    "description": "Create src/pages/admin/SearchResults.tsx — when global search Cmd+K results are clicked and there are many results, show full search results page. Results grouped by entity type with tabs. Each result shows relevant preview info and status badge. Click navigates to entity. Results paginated. Search query editable from results page.",
    "passes": false
  },
  {
    "id": "task-263",
    "title": "Create recent activity widget for dashboard",
    "description": "Create src/components/admin/dashboard/RecentActivity.tsx — shows latest activity across all modules. \"John created order #1234\", \"Stock low for Product X\", \"New customer signed up\", \"Delivery completed for order #1235\". Each entry clickable to related entity. Auto-refreshes every 30 seconds. Shows last 20 activities. Filter by module.",
    "passes": false
  },
  {
    "id": "task-264",
    "title": "Create quick create modal hub",
    "description": "Create src/components/admin/shared/QuickCreate.tsx — keyboard shortcut (Shift+N) opens modal with create options. Tabs for Order, Product, Customer, Vendor, Menu. Each tab shows a compact creation form. On submit, navigates to new entity detail page. Used from anywhere in admin. Pre-fills context when available (e.g. create order from customer page pre-fills customer).",
    "passes": false
  },
  {
    "id": "task-265",
    "title": "Create cross-module link resolver",
    "description": "Create src/hooks/useLinkResolver.ts — given any entity reference (type + id), resolves to a display card with name, status, and link. Used by all components that display entity references. Caches resolutions. Batch resolves multiple references efficiently. Fallback for deleted entities. Every cross-module link uses this for consistent rendering.",
    "passes": false
  },
  {
    "id": "task-266",
    "title": "Create admin keyboard shortcuts",
    "description": "Create src/hooks/useKeyboardShortcuts.ts — register global keyboard shortcuts. Cmd+K = search, Shift+N = quick create, Cmd+1-9 = navigate to modules, Escape = close modals/panels, Cmd+E = export current view. Show shortcut hints in UI. Shortcuts configurable in settings. Uses usePermissions to only register shortcuts for accessible modules.",
    "passes": false
  },
  {
    "id": "task-267",
    "title": "Create onboarding wizard for new tenants",
    "description": "Create src/pages/admin/Onboarding.tsx — step-by-step wizard for new tenants. Steps — business profile, add first products, configure delivery zones, create first menu, invite staff. Progress tracker. Skip and return later. Onboarding status tracked in tenant_settings. Dashboard shows onboarding progress if incomplete. Each step connects to its module's creation flow.",
    "passes": false
  },
  {
    "id": "task-268",
    "title": "Create module connection health checker",
    "description": "Create src/hooks/useModuleConnections.ts — verify all interconnections are working. Check that orders link to products correctly, inventory sync fires on order confirm, storefront products match admin, delivery creates from orders, notifications dispatch on events. Run on demand from system health page. Report shows each connection as pass/fail.",
    "passes": false
  },
  {
    "id": "task-269",
    "title": "Create data consistency validator",
    "description": "Create src/hooks/useDataConsistency.ts — checks for data inconsistencies across modules. Orphaned order items (product deleted but order item references it), inventory mismatches (calculated vs stored), customer records without valid contact info, deliveries without orders. Run on demand. Report shows issues with fix suggestions.",
    "passes": false
  },
  {
    "id": "task-270",
    "title": "Create admin dashboard widget customization",
    "description": "Create src/components/admin/dashboard/WidgetConfigurator.tsx — let users customize their dashboard layout. Drag-drop widgets — stats cards, recent activity, low stock, pending orders, delivery map, revenue chart, quick actions. Save layout per user. Default layouts per role (admin sees everything, runner sees deliveries). Widget size options.",
    "passes": false
  },
  {
    "id": "task-271",
    "title": "Create cross-module notification center page",
    "description": "Create src/pages/admin/NotificationCenter.tsx — full page view of all notifications. Tabs — All, Orders, Inventory, Deliveries, Customers, System. Each notification shows title, message, timestamp, related entity link, read status. Bulk mark as read. Filter by type and date. Infinite scroll. Settings link to notification preferences. Central hub for all module alerts.",
    "passes": false
  },
  {
    "id": "task-272",
    "title": "Create module interconnection documentation",
    "description": "Create src/docs/interconnections.md — developer documentation describing all module interconnections. Which events trigger which updates, which hooks connect which modules, data flow diagrams in mermaid format. List of all eventBus events and their subscribers. Query invalidation map. Useful for debugging and onboarding new developers.",
    "passes": false
  },
  {
    "id": "task-273",
    "title": "Create performance monitoring for interconnected queries",
    "description": "Create src/hooks/useQueryPerformance.ts — monitors TanStack Query performance across interconnected modules. Track query execution times, cache hit rates, waterfall of dependent queries. Log slow queries (>1s) to logger.warn. Show performance dashboard in dev mode. Helps identify bottlenecks in cross-module data fetching.",
    "passes": false
  },
  {
    "id": "task-274",
    "title": "Create end-to-end interconnectivity smoke test",
    "description": "Create src/tests/interconnectivity-smoke.test.ts — test that verifies key interconnections work. Test 1 — create order, verify inventory decremented. Test 2 — create customer, verify appears in customer list and is selectable in order creation. Test 3 — create product, verify appears on menu builder. Test 4 — complete delivery, verify order status updates. Uses testing-library and mock Supabase.",
    "passes": false
  },
  {
    "id": "task-275",
    "title": "Create admin help and documentation system",
    "description": "Create src/components/admin/shared/HelpPanel.tsx — contextual help panel accessible from any admin page. Shows documentation relevant to current module. Keyboard shortcut hints. Links to settings that affect current module. \"How to\" guides for common tasks. Search help content. Connects user to system documentation based on context.",
    "passes": false
  },
  {
    "id": "task-276",
    "title": "Create tenant data migration tool",
    "description": "Create src/pages/admin/DataMigration.tsx — import data from other systems. Support CSV import for orders, products, customers, vendors. Field mapping interface. Validation and preview. Dry run option. Import progress tracking. Error log for failed records. Useful for onboarding tenants migrating from other platforms. Connects to all entity creation hooks.",
    "passes": false
  },
  {
    "id": "task-277",
    "title": "Create admin activity summary email",
    "description": "Create Supabase Edge Function for daily activity summary email to admin. Summarize — orders received, revenue, new customers, inventory alerts, delivery stats, notable events. Formatted HTML email. Configurable in notification settings — daily, weekly, or disabled. Aggregates data from all modules into single digest. The ultimate interconnection — all modules summarized in one email.",
    "passes": false
  },
  {
    "id": "task-278",
    "title": "Create mobile responsive admin layout",
    "description": "Ensure AdminLayout, AdminSidebar, all data tables, detail pages, modals, and forms are fully responsive. Sidebar collapses to bottom nav on mobile. Tables become card-based on small screens. Modals become full-screen on mobile. Touch-friendly controls. Swipe gestures for navigation. All interconnected components maintain functionality on mobile.",
    "passes": false
  },
  {
    "id": "task-279",
    "title": "Create progressive web app configuration",
    "description": "Configure PWA for admin panel. Service worker for offline capability. Cache critical assets. Offline queue for mutations (creates, updates) — replay when online. Push notifications for order alerts. Install prompt. App manifest with tenant branding. Offline indicator banner. Connects PWA capabilities to notification and sync modules.",
    "passes": false
  },
  {
    "id": "task-280",
    "title": "Create admin dark mode support",
    "description": "Add dark mode toggle to admin panel. Uses Tailwind dark: classes. Respect system preference by default. Manual override persisted in user settings. All components — cards, tables, charts, modals, sidebars — properly themed. Chart colors adjust for dark backgrounds. Consistent dark mode across all interconnected modules. Toggle in header.",
    "passes": false
  },
  {
    "id": "task-281",
    "title": "Create final interconnectivity verification checklist",
    "description": "Create a comprehensive checklist component at src/components/admin/shared/InterconnectivityCheck.tsx that admin can run to verify all modules are properly connected. Checks — order creation decrements inventory, storefront orders appear in admin, customer LTV calculates correctly, delivery updates order status, menu products sync with catalog, notifications fire on events, analytics reflect all modules, search finds all entities. Green/red status for each check. One-click run all.",
    "passes": false
  },
  {
    "id": "task-282",
    "title": "Create payment processing hub page",
    "description": "Create src/pages/admin/Payments.tsx — central payment management page. Show all payments with status, amount, order reference, customer, method, date. Filter by status (pending/completed/failed/refunded), method, date range, amount range. Stats cards — total collected today, pending, refunded. Each payment links to order and customer.",
    "passes": false
  },
  {
    "id": "task-283",
    "title": "Create payment detail page",
    "description": "Create src/pages/admin/PaymentDetail.tsx — full payment detail view. Payment amount, method, status, timestamp, order reference (clickable), customer (clickable), transaction ID, processing fees. Refund button if completed. Payment history timeline. Related order items. Connected to order and customer modules bidirectionally.",
    "passes": false
  },
  {
    "id": "task-284",
    "title": "Create payment recording on orders",
    "description": "In order detail page, add payment recording section. Record payment — amount, method (cash/card/transfer/credit), reference number, notes. Partial payments supported. Payment progress bar. When fully paid, update order payment_status. Publish payment_received event to eventBus. Create notification. Log to activity_log.",
    "passes": false
  },
  {
    "id": "task-285",
    "title": "Create Supabase migration for payments table",
    "description": "Create supabase/migrations/add_payments.sql if not exists. Columns — id uuid primary key, tenant_id uuid, order_id uuid, customer_id uuid, amount decimal not null, method text, status text (pending/completed/failed/refunded), transaction_id text, processing_fee decimal default 0, notes text, processed_by uuid, created_at timestamptz, updated_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-286",
    "title": "Create payment refund workflow",
    "description": "Create src/components/admin/payments/RefundFlow.tsx — guided refund process. Select payment to refund. Full or partial amount. Reason selection (customer_request/defective/wrong_item/other). Confirmation step. On confirm — create refund record, update payment status, optionally restore inventory, update order status, notify customer, log to activity. Connects payments to inventory and orders.",
    "passes": false
  },
  {
    "id": "task-287",
    "title": "Create payment method analytics",
    "description": "Create src/components/admin/analytics/PaymentMethods.tsx — breakdown of payment methods used. Pie chart of methods (cash/card/transfer). Trend of each method over time. Average transaction value per method. Processing fee totals per method. Helps understand customer payment preferences. Data from payments table.",
    "passes": false
  },
  {
    "id": "task-288",
    "title": "Create outstanding payments report",
    "description": "Create src/components/admin/payments/OutstandingReport.tsx — all orders with pending payments. Aging buckets — 0-7 days, 8-14 days, 15-30 days, 30+ days. Total outstanding amount. Customer-level aggregation of outstanding. One-click to send payment reminder. Priority sorting by amount and age. Export to CSV.",
    "passes": false
  },
  {
    "id": "task-289",
    "title": "Create payment reconciliation tool",
    "description": "Create src/components/admin/payments/Reconciliation.tsx — match payments to orders. Upload bank statement CSV. Auto-match by amount and date. Flag unmatched transactions. Manual matching interface. Reconciliation report. Marks orders as paid when matched. Useful for cash-heavy cannabis businesses.",
    "passes": false
  },
  {
    "id": "task-290",
    "title": "Create daily cash register/till management",
    "description": "Create src/pages/admin/CashRegister.tsx — track cash register operations. Open register with starting float. Record sales throughout day. Track cash in/cash out. Close register with count. Variance report (expected vs actual). Daily register report. Links to orders processed during shift. Per-user register sessions.",
    "passes": false
  },
  {
    "id": "task-291",
    "title": "Create Supabase migration for register_sessions table",
    "description": "Create supabase/migrations/add_register_sessions.sql. Columns — id uuid primary key, tenant_id uuid, user_id uuid, opening_float decimal, closing_amount decimal, expected_amount decimal, variance decimal, status text (open/closed), opened_at timestamptz, closed_at timestamptz, notes text. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-292",
    "title": "Create payment-customer credit integration",
    "description": "When recording payment, option to apply customer credit. Show credit balance. Partial credit + partial cash/card. On credit use, deduct from customer credit balance. Create credit transaction record. Update payment with credit_applied amount. Connects payment flow to customer credit system.",
    "passes": false
  },
  {
    "id": "task-293",
    "title": "Create payment-loyalty points integration",
    "description": "When payment completed, auto-calculate and award loyalty points. Points rate from tenant settings. Show points earned on receipt. When customer redeems points, create negative payment adjustment. Points transaction linked to payment and order. Connects payment to loyalty module.",
    "passes": false
  },
  {
    "id": "task-294",
    "title": "Create vendor payment tracking page",
    "description": "Create src/pages/admin/VendorPayments.tsx — track payments to vendors. Linked to purchase orders. Payment status per PO. Total outstanding to each vendor. Payment schedule. Mark PO as paid. Payment history per vendor. Outstanding payables dashboard widget. Connects vendor module to payment tracking.",
    "passes": false
  },
  {
    "id": "task-295",
    "title": "Create payment notifications",
    "description": "When payment is received, notify relevant parties. Notify admin of payment received. Notify customer of payment confirmation. If payment fails, notify admin immediately. If refund processed, notify customer. All via useNotificationDispatcher. Email receipt option for completed payments.",
    "passes": false
  },
  {
    "id": "task-296",
    "title": "Create tip tracking on payments",
    "description": "Add tip_amount field to payments. Optional tip entry during payment recording. Tips tracked separately in analytics. Tip distribution to runners for delivery orders. Daily tip report per runner. Tip totals on payment dashboard. Connects to delivery runner compensation tracking.",
    "passes": false
  },
  {
    "id": "task-297",
    "title": "Create payment dashboard stats",
    "description": "On main dashboard, add payment stats widget. Today's collections, outstanding invoices, failed payments needing attention, refunds processed. Each stat clickable to filtered payment list. Uses useDashboardStats hook extended with payment metrics. Real-time updates.",
    "passes": false
  },
  {
    "id": "task-298",
    "title": "Create split payment support",
    "description": "Allow splitting payment for one order across multiple methods. Example — $50 cash + $30 card. Each split creates separate payment record linked to same order. Total must equal order amount. UI shows payment method strips that sum to total. Useful for in-person transactions.",
    "passes": false
  },
  {
    "id": "task-299",
    "title": "Create payment export for accounting",
    "description": "Export payment data in accounting-friendly format. Include date, order number, customer, amount, method, tax, processing fees, net amount. Group by day or week. Export as CSV compatible with QuickBooks, Xero, Wave. Scheduled export option. Connects payment module to external accounting.",
    "passes": false
  },
  {
    "id": "task-300",
    "title": "Create invoice tracking page",
    "description": "Create src/pages/admin/Invoices.tsx — manage all invoices generated from orders. Invoice list with status (draft/sent/paid/overdue). Link to order and customer. Resend invoice action. Payment recording from invoice. Overdue invoice alerts. Aging report. Connects orders, payments, and customer billing.",
    "passes": false
  },
  {
    "id": "task-301",
    "title": "Create payment dispute management",
    "description": "Create src/components/admin/payments/Disputes.tsx — track payment disputes/chargebacks. Record dispute with reason, evidence, status. Link to original payment and order. Timeline of dispute resolution. Outcome tracking. Dispute rate analytics. Connects payment issues to order and customer history.",
    "passes": false
  },
  {
    "id": "task-302",
    "title": "Create messaging hub page",
    "description": "Create src/pages/admin/Messages.tsx — central messaging interface. Tabs — Customer Messages, Staff Messages, Broadcast. Customer conversations threaded by customer. Staff messages for internal communication. Search messages. Message templates. Unread badge counts. Connects to customer records and order references.",
    "passes": false
  },
  {
    "id": "task-303",
    "title": "Create customer messaging from order context",
    "description": "On order detail page, add \"Message Customer\" action. Opens messaging panel pre-filled with customer contact and order reference. Message templates for common scenarios — order confirmation, delay notification, delivery update, payment reminder. Send via SMS or in-app. Message logged to customer communication history.",
    "passes": false
  },
  {
    "id": "task-304",
    "title": "Create broadcast messaging system",
    "description": "Create src/components/admin/messages/Broadcast.tsx — send messages to customer groups. Select audience — all customers, segment (VIP, active, at_risk), tag-based, custom list. Message templates with merge fields (name, last order). Schedule send time. Track delivery and open rates. Connects customer segmentation to communication.",
    "passes": false
  },
  {
    "id": "task-305",
    "title": "Create Supabase migration for messages table",
    "description": "Create supabase/migrations/add_messages.sql. Columns — id uuid primary key, tenant_id uuid, sender_type text (admin/customer/system), sender_id uuid, recipient_type text, recipient_id uuid, channel text (sms/email/in_app), subject text, body text, reference_type text, reference_id uuid, status text (draft/sent/delivered/read/failed), sent_at timestamptz, created_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-306",
    "title": "Create message template management",
    "description": "Create src/components/admin/messages/Templates.tsx — CRUD for message templates. Template fields — name, channel (SMS/email), subject, body with merge variables ({customer_name}, {order_number}, {delivery_eta}). Category tags. Usage count. Last used date. Clone template. Preview with sample data. Used across all messaging touchpoints.",
    "passes": false
  },
  {
    "id": "task-307",
    "title": "Create Supabase migration for message_templates table",
    "description": "Create supabase/migrations/add_message_templates.sql. Columns — id uuid primary key, tenant_id uuid, name text, channel text, subject text, body text, variables jsonb, category text, usage_count integer default 0, is_active boolean default true, created_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-308",
    "title": "Create automated message triggers",
    "description": "Create src/components/admin/settings/AutoMessages.tsx — configure automated messages for events. Triggers — order_confirmed, delivery_dispatched, delivery_completed, payment_received, welcome_new_customer, birthday, re_engagement (no order in X days). Map triggers to templates. Enable/disable per trigger. Connects eventBus events to customer communication.",
    "passes": false
  },
  {
    "id": "task-309",
    "title": "Create staff internal messaging",
    "description": "Create src/components/admin/messages/StaffChat.tsx — simple internal messaging between staff. Mention orders, products, customers by typing @ and searching. Mentioned entities become clickable links. Useful for coordination — \"Check order #1234, customer says wrong item\". Group channels for teams. Connects staff communication to all entity modules.",
    "passes": false
  },
  {
    "id": "task-310",
    "title": "Create delivery runner messaging",
    "description": "Message delivery runners from order or delivery detail. Pre-built messages — \"Customer is not responding\", \"Address update: [new address]\", \"Call customer before delivery\". Runner can reply from mobile view. Message history on delivery record. Connects messaging to delivery operations.",
    "passes": false
  },
  {
    "id": "task-311",
    "title": "Create customer feedback request automation",
    "description": "After order delivery, auto-send feedback request to customer. Configurable delay (1 hour, 1 day). Simple rating form link. Feedback linked to order, customer, runner. Results on delivery analytics dashboard. Response rate tracking. Template customizable. Connects post-delivery communication to analytics.",
    "passes": false
  },
  {
    "id": "task-312",
    "title": "Create message analytics",
    "description": "Create src/components/admin/analytics/MessageAnalytics.tsx — messaging performance metrics. Total messages sent by channel. Delivery rate, open rate (email), response rate. Broadcast performance. Template usage ranking. Best performing messages. Customer engagement score based on message interactions. Connects messaging to analytics module.",
    "passes": false
  },
  {
    "id": "task-313",
    "title": "Create SMS integration connector",
    "description": "Create src/lib/sms/connector.ts — abstraction layer for SMS providers (Twilio, etc). Send SMS, check delivery status, receive replies. Configurable in integrations settings. Fallback handling. Rate limiting. Cost tracking per message. Connected to messaging system and automated triggers.",
    "passes": false
  },
  {
    "id": "task-314",
    "title": "Create email integration connector",
    "description": "Create src/lib/email/connector.ts — abstraction layer for email sending (SendGrid, SES, etc). Send transactional emails with templates. Track delivery and opens. Configurable in integrations settings. HTML email template rendering with tenant branding. Connected to messaging, invoices, reports.",
    "passes": false
  },
  {
    "id": "task-315",
    "title": "Create customer communication preferences",
    "description": "On customer detail page, manage communication preferences. Opt-in/opt-out per channel (SMS, email, in-app). Preferred language. Quiet hours. Frequency preference. Unsubscribe link in messages. Preferences respected by all messaging modules. Stored on customer record. GDPR/compliance friendly.",
    "passes": false
  },
  {
    "id": "task-316",
    "title": "Create message scheduling",
    "description": "Create src/components/admin/messages/MessageScheduler.tsx — schedule messages for future sending. Date/time picker. Preview before schedule. Scheduled messages queue visible in messaging hub. Cancel or edit scheduled messages. Timezone-aware using tenant settings. Used for broadcasts and individual messages.",
    "passes": false
  },
  {
    "id": "task-317",
    "title": "Create POS interface page",
    "description": "Create src/pages/admin/POS.tsx — point of sale interface for walk-in customers. Product grid with categories. Quick search by name or barcode. Add to cart with quantity. Customer assignment (optional — search or walk-in). Running total display. Payment processing. Receipt generation. Optimized for touch and speed. Full-screen mode.",
    "passes": false
  },
  {
    "id": "task-318",
    "title": "Create POS product grid",
    "description": "Create src/components/admin/pos/ProductGrid.tsx — touch-friendly product grid for POS. Products displayed as cards with image, name, price. Category tabs for filtering. Quick search bar. Stock indicator on each card. Tap to add to cart. Long-press for product details. Grayed out for out-of-stock. Synced with product catalog in real-time.",
    "passes": false
  },
  {
    "id": "task-319",
    "title": "Create POS cart component",
    "description": "Create src/components/admin/pos/POSCart.tsx — shopping cart sidebar in POS. Shows added items with quantity controls (+/-/remove). Subtotal, tax, total calculations. Customer selection optional. Apply discount (percentage or fixed). Apply customer credit. Notes field. Checkout button. Cart persists during session via state.",
    "passes": false
  },
  {
    "id": "task-320",
    "title": "Create POS checkout flow",
    "description": "Create src/components/admin/pos/POSCheckout.tsx — streamlined checkout. Payment method selection (cash/card). Cash payment shows change calculator. Card payment integration. Split payment support. Apply loyalty points. Generate receipt. Create order record in database with source=pos. Decrement inventory. Update cash register. Award loyalty points. All interconnected.",
    "passes": false
  },
  {
    "id": "task-321",
    "title": "Create POS receipt printing",
    "description": "Create src/components/admin/pos/POSReceipt.tsx — generates receipt for POS transactions. Business info from tenant profile, items, prices, tax, total, payment method, change given, date/time, transaction ID. Print button for receipt printer. Email receipt option. Receipt linked to order. Uses tenant branding settings.",
    "passes": false
  },
  {
    "id": "task-322",
    "title": "Create POS customer lookup",
    "description": "In POS, quick customer lookup by phone number scan or manual entry. If found, show customer name, loyalty points, credit balance, purchase history summary. Apply customer-specific pricing. Award loyalty points. If not found, offer to create new customer. Fast typeahead search. Connects POS to full customer module.",
    "passes": false
  },
  {
    "id": "task-323",
    "title": "Create POS inventory real-time check",
    "description": "POS displays real-time inventory for every product in grid. When stock changes (from admin order, storefront order, or another POS terminal), grid updates instantly via Supabase realtime. Prevents selling out-of-stock items. Low stock warning on product cards. Out of stock items hidden or crossed out.",
    "passes": false
  },
  {
    "id": "task-324",
    "title": "Create POS daily summary report",
    "description": "Create src/components/admin/pos/DailyReport.tsx — end-of-day POS summary. Total transactions count, total revenue, average transaction value, payment method breakdown, top selling products, customer count (new vs returning), cash register reconciliation. Compare to previous day. Print or export report. Connected to register session.",
    "passes": false
  },
  {
    "id": "task-325",
    "title": "Create POS barcode scanning support",
    "description": "Create src/hooks/useBarcodeScanner.ts — listen for barcode scanner input. Detect barcode scan pattern (rapid keystrokes ending in Enter). Lookup product by barcode/SKU. Auto-add to POS cart. Beep sound on successful scan. Error sound and toast if product not found. Supports USB and Bluetooth scanners. Connects physical hardware to product catalog.",
    "passes": false
  },
  {
    "id": "task-326",
    "title": "Create POS discount and promo code support",
    "description": "In POS checkout, add promo code entry field. Validate against active promotions table. Apply percentage or fixed discount. Customer-specific discounts auto-applied when customer selected. Manual discount with manager approval (permission check). Discount logged on order. Discount analytics tracking.",
    "passes": false
  },
  {
    "id": "task-327",
    "title": "Create Supabase migration for promotions table",
    "description": "Create supabase/migrations/add_promotions.sql. Columns — id uuid primary key, tenant_id uuid, code text unique per tenant, name text, discount_type text (percentage/fixed), discount_value decimal, min_order_amount decimal, max_uses integer, current_uses integer default 0, applies_to text (all/category/product), applies_to_ids uuid[], start_date timestamptz, end_date timestamptz, is_active boolean default true, created_at timestamptz. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-328",
    "title": "Create POS hold order functionality",
    "description": "In POS, ability to hold current cart and start new transaction. Show held orders list. Resume held order. Hold order preserved with items and customer. Timeout after configurable period (auto-cancel held order). Useful when customer steps away. Held order items still reserved in inventory temporarily.",
    "passes": false
  },
  {
    "id": "task-329",
    "title": "Create POS quick product favorites",
    "description": "Create src/components/admin/pos/Favorites.tsx — pinned favorite products in POS for one-tap access. Each staff member can customize their favorites. Most sold products auto-suggested. Drag-to-reorder favorites. Category-level favorites for quick access. Stored per user in user_settings. Speeds up frequent transactions.",
    "passes": false
  },
  {
    "id": "task-330",
    "title": "Create POS multi-terminal support",
    "description": "Support multiple POS terminals for same tenant. Each terminal has unique ID. Inventory changes synchronized in real-time across terminals. Individual register sessions per terminal. Transaction log per terminal. Conflict handling for simultaneous stock access. Terminal management in settings.",
    "passes": false
  },
  {
    "id": "task-331",
    "title": "Create POS returns and exchanges",
    "description": "Create src/components/admin/pos/Returns.tsx — process returns at POS. Lookup original order by receipt number or customer. Select items to return. Reason selection. Refund to original payment method or store credit. Inventory restored for returned items. Return logged as separate transaction linked to original order. Connects POS to refund, inventory, and customer credit modules.",
    "passes": false
  },
  {
    "id": "task-332",
    "title": "Create POS to delivery handoff",
    "description": "In POS, option to convert walk-in order to delivery. Customer provides delivery address. Calculate delivery fee. Assign to runner. Order source changes from pos to pos_delivery. Delivery record created. Customer notified. Connects POS workflow to delivery module seamlessly.",
    "passes": false
  },
  {
    "id": "task-333",
    "title": "Create POS analytics integration",
    "description": "POS transactions feed into main analytics. Revenue attributed to POS channel. Compare POS vs online sales. Peak hours heatmap for POS. Items per transaction average. Customer conversion (walk-in to registered). POS-specific dashboard widget. All POS data flows through same order and payment pipeline.",
    "passes": false
  },
  {
    "id": "task-334",
    "title": "Create POS offline mode",
    "description": "Create src/hooks/usePOSOffline.ts — POS continues working when internet drops. Cache product catalog locally. Queue transactions in IndexedDB. Sync when connection restored. Show offline indicator. Inventory quantities may be stale — show warning. Payment processing limited to cash in offline mode. Critical for uninterrupted retail operations.",
    "passes": false
  },
  {
    "id": "task-335",
    "title": "Create POS staff quick login",
    "description": "Create src/components/admin/pos/StaffLogin.tsx — fast staff switching on POS terminal. PIN-based login instead of full email/password. Staff avatar selection grid. Quick switch between staff without full logout. Each transaction tagged with current staff. Shift tracking per staff member. Connects to user management module.",
    "passes": false
  },
  {
    "id": "task-336",
    "title": "Create POS training mode",
    "description": "Create src/hooks/usePOSTrainingMode.ts — training mode for new staff. All POS functionality works but no real transactions created. No inventory affected. No payments processed. Clear \"TRAINING\" watermark on screen. Training transactions logged separately. Manager can enable/disable per terminal. Connects to user permissions.",
    "passes": false
  },
  {
    "id": "task-337",
    "title": "Create POS end-of-day closeout workflow",
    "description": "Create src/components/admin/pos/CloseoutWizard.tsx — guided end-of-day process. Steps — count cash drawer, reconcile with expected amount, record variance, close register session, generate day summary report, review held orders (cancel or process), export transactions, backup data. Each step validates before proceeding. Final summary page with all stats.",
    "passes": false
  },
  {
    "id": "task-338",
    "title": "Create POS customer display",
    "description": "Create src/components/admin/pos/CustomerDisplay.tsx — secondary display showing cart to customer. Running total, items being scanned, loyalty points earned, promotions applied. Can be shown on separate monitor or tablet. Real-time sync with POS cart state. Tenant branding. After payment shows thank you with points earned.",
    "passes": false
  },
  {
    "id": "task-339",
    "title": "Create POS integration with loyalty module",
    "description": "Full loyalty integration in POS. Show points balance when customer selected. Option to redeem points at checkout. Points redemption creates credit applied to payment. Points earned displayed on receipt. Tier status shown. Tier upgrade notification at POS. Connects POS checkout to loyalty points and customer modules.",
    "passes": false
  },
  {
    "id": "task-340",
    "title": "Create POS product modifier support",
    "description": "Create src/components/admin/pos/ProductModifiers.tsx — add modifiers to POS items. Modifiers like size (1g/3.5g/7g), grade (A/B/C), preparation notes. Modifiers can adjust price. Configured per product in product settings. Shown as popup when adding product to cart. Modifier selections stored on order items. Connects to product variant system.",
    "passes": false
  },
  {
    "id": "task-341",
    "title": "Create B2B marketplace landing page",
    "description": "Create src/pages/admin/Marketplace.tsx — internal B2B marketplace dashboard. Browse wholesale offerings from connected vendors. Product catalog with wholesale pricing. Minimum order quantities. Vendor ratings visible. Quick order from marketplace. Connects vendor product catalogs to tenant purchasing workflow.",
    "passes": false
  },
  {
    "id": "task-342",
    "title": "Create marketplace product listing",
    "description": "Create src/components/admin/marketplace/ProductListing.tsx — display marketplace products with vendor info, wholesale price, MOQ, lead time, compliance badges. Compare prices across vendors for same product. Add to purchase order cart. Filter by category, vendor, price range, availability. Connected to vendor catalog sync.",
    "passes": false
  },
  {
    "id": "task-343",
    "title": "Create marketplace order placement",
    "description": "Create src/components/admin/marketplace/MarketplaceOrder.tsx — place wholesale orders through marketplace. Select products and quantities. Auto-creates purchase order linked to vendor. Payment terms from vendor record. Expected delivery calculation from lead time. Confirmation flow. PO notification to vendor. Connects marketplace to PO and vendor modules.",
    "passes": false
  },
  {
    "id": "task-344",
    "title": "Create marketplace vendor storefront",
    "description": "Create src/pages/marketplace/VendorStorefront.tsx — public-facing vendor storefront within FloraIQ marketplace. Vendors can list products for other tenants to browse. Product catalog, pricing, MOQs, compliance docs. Buyer inquiries. Connected to vendor profile and product management.",
    "passes": false
  },
  {
    "id": "task-345",
    "title": "Create marketplace search and discovery",
    "description": "Create src/hooks/useMarketplaceSearch.ts — search marketplace products across all vendors. Full-text search on product name and description. Filter by THC/CBD range, product type, vendor location, price range. Sort by price, rating, relevance. Results show vendor badge and compliance status. Connected to vendor and product modules.",
    "passes": false
  },
  {
    "id": "task-346",
    "title": "Create marketplace price comparison tool",
    "description": "Create src/components/admin/marketplace/PriceCompare.tsx — compare same or similar products across multiple vendors. Side-by-side pricing, MOQs, lead times, ratings. Historical price chart per vendor. Best deal highlighting. One-click to add best option to PO. Connects marketplace to vendor analytics and purchase orders.",
    "passes": false
  },
  {
    "id": "task-347",
    "title": "Create marketplace order tracking",
    "description": "Track marketplace orders from placement to delivery. Status timeline — ordered, confirmed by vendor, shipped, in transit, received. Updates from vendor side. ETA tracking. Discrepancy reporting on receipt. Auto-update inventory on receive. Connects marketplace orders to inventory and PO receiving.",
    "passes": false
  },
  {
    "id": "task-348",
    "title": "Create marketplace messaging between buyer and vendor",
    "description": "In marketplace, messaging between tenants (buyer and vendor). Discuss pricing, product availability, custom orders. Messages linked to specific products or POs. Message history preserved. Notification on new messages. Connects to messaging module with marketplace-specific context.",
    "passes": false
  },
  {
    "id": "task-349",
    "title": "Create marketplace analytics",
    "description": "Create src/components/admin/analytics/MarketplaceAnalytics.tsx — marketplace usage metrics. Products browsed, POs created through marketplace, total marketplace spend, vendor response times, price savings vs direct ordering, popular search terms. Helps tenants optimize purchasing. Data from marketplace events and POs.",
    "passes": false
  },
  {
    "id": "task-350",
    "title": "Create marketplace wishlist and alerts",
    "description": "Save products to wishlist in marketplace. Set price alerts — notify when product price drops below threshold. Set availability alerts — notify when out-of-stock product becomes available. Wishlist on marketplace dashboard. Alerts via notification system. Connects marketplace browsing to notification module.",
    "passes": false
  },
  {
    "id": "task-351",
    "title": "Create marketplace compliance verification",
    "description": "Marketplace products must show compliance status. Verify vendor licenses are current. Product lab test results available. COA (Certificate of Analysis) download. Non-compliant products flagged or hidden. Compliance filter in search. Regulatory badge display. Connects marketplace to compliance verification system.",
    "passes": false
  },
  {
    "id": "task-352",
    "title": "Create marketplace bulk ordering",
    "description": "Create src/components/admin/marketplace/BulkOrder.tsx — import product list (CSV) and auto-match to marketplace products. Bulk add to PO. Split across multiple vendors automatically based on best price or preferred vendor. Preview before submission. Useful for large restocking orders. Connects import utility to marketplace and PO system.",
    "passes": false
  },
  {
    "id": "task-353",
    "title": "Create marketplace vendor rating from buyer",
    "description": "After receiving marketplace order, rate vendor on delivery time, product quality, communication, packaging. Rating linked to PO and vendor. Aggregate ratings visible on marketplace. Helps other tenants choose vendors. Rating history on vendor profile. Connects marketplace experience to vendor analytics.",
    "passes": false
  },
  {
    "id": "task-354",
    "title": "Create marketplace saved vendor list",
    "description": "Save preferred vendors in marketplace. Quick access to their catalogs. Auto-notify on new products from saved vendors. Preferred vendor pricing if applicable. Saved vendors list on marketplace dashboard. Connects vendor relationships to marketplace discovery.",
    "passes": false
  },
  {
    "id": "task-355",
    "title": "Create marketplace trending products",
    "description": "Create src/components/admin/marketplace/Trending.tsx — show trending products across marketplace. Based on order volume, search frequency, and price changes. Updated daily. Category-specific trends. Helps tenants discover popular products. Connected to marketplace analytics and search data.",
    "passes": false
  },
  {
    "id": "task-356",
    "title": "Create API key management page",
    "description": "Create src/pages/admin/APIKeys.tsx — generate and manage API keys per tenant. Key name, permissions scope, rate limit, expiration. Revoke keys. Usage statistics per key. Last used timestamp. Connected to integrations settings. Enables external systems to interact with FloraIQ data.",
    "passes": false
  },
  {
    "id": "task-357",
    "title": "Create REST API for orders",
    "description": "Create Supabase Edge Function api-orders — CRUD endpoints for orders. GET /orders (list with pagination), GET /orders/:id (detail with items), POST /orders (create), PATCH /orders/:id (update status). API key authentication. Tenant isolation via API key. Rate limiting. Returns same data as admin UI. Enables external order integrations.",
    "passes": false
  },
  {
    "id": "task-358",
    "title": "Create REST API for products",
    "description": "Create Supabase Edge Function api-products — CRUD endpoints for products. GET /products (list with filters), GET /products/:id (detail with inventory), POST /products (create), PATCH /products/:id (update). Stock level included in response. Category and vendor references. Enables external product catalog integrations.",
    "passes": false
  },
  {
    "id": "task-359",
    "title": "Create REST API for customers",
    "description": "Create Supabase Edge Function api-customers — CRUD endpoints for customers. GET /customers (list with search), GET /customers/:id (detail with order history), POST /customers (create), PATCH /customers/:id (update). LTV and segment included. Enables CRM integrations and external customer management.",
    "passes": false
  },
  {
    "id": "task-360",
    "title": "Create REST API for inventory",
    "description": "Create Supabase Edge Function api-inventory — inventory endpoints. GET /inventory (all products with stock levels), GET /inventory/:productId/history (stock history), POST /inventory/:productId/adjust (stock adjustment). Adjustment creates inventory_history entry. Enables external inventory management system sync.",
    "passes": false
  },
  {
    "id": "task-361",
    "title": "Create webhook delivery system",
    "description": "Create src/lib/webhooks/dispatcher.ts — when events fire on eventBus, check for matching webhook subscriptions. Format payload with event data. Send HTTP POST with HMAC signature. Retry on failure (3 attempts with exponential backoff). Log delivery status. Connects internal events to external systems.",
    "passes": false
  },
  {
    "id": "task-362",
    "title": "Create webhook event formatting",
    "description": "Create src/lib/webhooks/formatters.ts — format webhook payloads for each event type. Standard envelope — event_type, timestamp, tenant_id, data. Event-specific data includes all relevant entity data. For order_created — full order with items, customer, totals. For inventory_changed — product, old quantity, new quantity, reason.",
    "passes": false
  },
  {
    "id": "task-363",
    "title": "Create webhook testing interface",
    "description": "Create src/components/admin/settings/WebhookTester.tsx — test webhook endpoints from admin. Select event type, view sample payload, send test request to configured URL, view response. Debug failed webhooks with request/response logs. Retry failed deliveries manually. Connects webhook configuration to debugging tools.",
    "passes": false
  },
  {
    "id": "task-364",
    "title": "Create API usage analytics",
    "description": "Create src/components/admin/analytics/APIUsage.tsx — track API usage per key and endpoint. Request count, error rate, response time, top endpoints, rate limit hits. Usage trend chart. Alert when approaching rate limits. Billing-relevant metrics if API is metered. Connected to API key management.",
    "passes": false
  },
  {
    "id": "task-365",
    "title": "Create inbound webhook receiver",
    "description": "Create Supabase Edge Function webhook-receiver — receive incoming webhooks from external systems. Verify signatures. Route to appropriate handler based on source. Create or update entities in FloraIQ. Log all received webhooks. Error handling and retry guidance. Enables external systems to push data into FloraIQ.",
    "passes": false
  },
  {
    "id": "task-366",
    "title": "Create Zapier/integration connector",
    "description": "Create src/components/admin/integrations/ZapierConnect.tsx — connect FloraIQ to Zapier. Expose triggers (new order, new customer, low stock) and actions (create order, update product, send message). OAuth flow for Zapier. Enables no-code integrations with hundreds of external tools. Connects FloraIQ to broader ecosystem.",
    "passes": false
  },
  {
    "id": "task-367",
    "title": "Create API documentation page",
    "description": "Create src/pages/admin/APIDocs.tsx — interactive API documentation. List all endpoints with parameters, example requests/responses, authentication guide. Try-it-out feature (send requests from docs). Code examples in curl, JavaScript, Python. Connected to actual API endpoints. Auto-generated from endpoint definitions.",
    "passes": false
  },
  {
    "id": "task-368",
    "title": "Create data sync status dashboard",
    "description": "Create src/components/admin/integrations/SyncStatus.tsx — overview of all external sync connections. Show each integration (POS, accounting, marketplace, webhooks) with last sync time, status (healthy/error), records synced. Trigger manual sync. View sync logs. Alert on sync failures. Centralizes all external connectivity status.",
    "passes": false
  },
  {
    "id": "task-369",
    "title": "Create CSV/API import queue",
    "description": "Create src/pages/admin/ImportQueue.tsx — manage all data imports (CSV, API, marketplace). Show queue with status (pending/processing/completed/failed). Progress bars for active imports. Error details for failed records. Retry failed imports. Import history. Connects all import pathways into single management interface.",
    "passes": false
  },
  {
    "id": "task-370",
    "title": "Create external POS integration",
    "description": "Create Supabase Edge Function pos-integration — sync with external POS systems. Receive transaction data from external POS. Map to FloraIQ orders and inventory. Bidirectional product sync. External POS configuration in integrations settings. Connects FloraIQ to hardware POS terminals used in physical stores.",
    "passes": false
  },
  {
    "id": "task-371",
    "title": "Create mobile admin dashboard",
    "description": "Create src/pages/mobile/MobileDashboard.tsx — mobile-optimized admin dashboard. Key stats cards in scrollable grid. Quick action buttons — create order, scan barcode, view deliveries. Recent notifications. Swipe-to-refresh. Bottom navigation bar. All data from same hooks as desktop dashboard. Responsive design with touch targets.",
    "passes": false
  },
  {
    "id": "task-372",
    "title": "Create mobile order creation flow",
    "description": "Create src/pages/mobile/MobileOrderCreate.tsx — streamlined order creation for mobile. Product search with barcode scanning. Camera scan for barcodes. Customer quick lookup by phone. Simplified form with essential fields only. Large touch targets. Swipe between steps. Same inventory validation as desktop. Creates same order records.",
    "passes": false
  },
  {
    "id": "task-373",
    "title": "Create mobile inventory scanner",
    "description": "Create src/pages/mobile/InventoryScanner.tsx — scan products and update inventory on mobile. Camera barcode scanning. Show current stock. Quick adjust (+/-) buttons. Batch scan mode for audits. Scan history log. Syncs to inventory_history. Useful for warehouse staff doing stock counts. Offline scan queue with sync.",
    "passes": false
  },
  {
    "id": "task-374",
    "title": "Create mobile customer lookup",
    "description": "Create src/pages/mobile/CustomerLookup.tsx — quick customer lookup on mobile. Search by phone, name, email. Show customer card with key info — name, phone, LTV, last order, loyalty points. Quick actions — create order, view orders, send message. Tap phone to call. Tap email to compose. Same data as desktop customer module.",
    "passes": false
  },
  {
    "id": "task-375",
    "title": "Create mobile delivery runner app",
    "description": "Enhance src/pages/mobile/RunnerView.tsx — full runner delivery app. Route view with navigation integration. Order details for each stop. Customer contact (tap to call/message). Status update buttons with one-tap confirm. Photo capture for proof of delivery. Signature capture. Offline capability. Location tracking. Connected to delivery and order modules.",
    "passes": false
  },
  {
    "id": "task-376",
    "title": "Create mobile push notification support",
    "description": "Create src/lib/pushNotifications.ts — register for web push notifications. Service worker handles notification display. Notification click opens relevant admin page. Permission request flow. Notification preferences synced with server. Works on mobile and desktop PWA. Connected to notification dispatcher.",
    "passes": false
  },
  {
    "id": "task-377",
    "title": "Create mobile product quick edit",
    "description": "Create src/pages/mobile/ProductQuickEdit.tsx — scan product barcode, quickly update price or stock. Large input fields for mobile. Confirm button with haptic feedback. History of recent edits. Batch edit mode. Changes sync immediately to product and inventory modules. Useful for field price updates.",
    "passes": false
  },
  {
    "id": "task-378",
    "title": "Create mobile report viewer",
    "description": "Create src/pages/mobile/MobileReports.tsx — view key reports on mobile. Daily sales summary, inventory alerts, delivery performance. Charts optimized for small screens. Swipe between report sections. Share report via mobile share sheet. Data from same analytics hooks. Responsive charts using recharts.",
    "passes": false
  },
  {
    "id": "task-379",
    "title": "Create mobile menu builder preview",
    "description": "Create src/pages/mobile/MenuPreview.tsx — preview how menus look on mobile devices while editing. Side-by-side with desktop preview. Test customer ordering flow from mobile perspective. Check touch targets and scrolling. Directly connected to menu builder state. Live preview updates.",
    "passes": false
  },
  {
    "id": "task-380",
    "title": "Create mobile staff time tracking",
    "description": "Create src/pages/mobile/TimeTracking.tsx — clock in/out for staff on mobile. GPS location capture at clock in. Break tracking. Shift summary. Connected to user management. Time data used for labor cost analysis in financial analytics. Manager approval workflow. Overtime alerts.",
    "passes": false
  },
  {
    "id": "task-381",
    "title": "Create Supabase migration for time_entries table",
    "description": "Create supabase/migrations/add_time_entries.sql. Columns — id uuid primary key, tenant_id uuid, user_id uuid, clock_in timestamptz, clock_out timestamptz, break_minutes integer default 0, location_lat decimal, location_lng decimal, status text (active/completed/approved), notes text, approved_by uuid. RLS by tenant_id.",
    "passes": false
  },
  {
    "id": "task-382",
    "title": "Create mobile offline data sync",
    "description": "Create src/lib/offlineSync.ts — comprehensive offline sync for mobile. Cache critical data (products, customers, active orders) in IndexedDB. Queue mutations when offline. Sync queue when back online with conflict resolution. Show sync status indicator. Priority sync for orders and inventory. Connected to all CRUD operations across modules.",
    "passes": false
  },
  {
    "id": "task-383",
    "title": "Create mobile camera integration",
    "description": "Create src/hooks/useCamera.ts — unified camera access for mobile features. Barcode scanning, product photo capture, proof of delivery photo, receipt scanning. Camera permission handling. Image compression before upload. Gallery fallback. Connected to product images, delivery proofs, and inventory scanning.",
    "passes": false
  },
  {
    "id": "task-384",
    "title": "Create mobile location services",
    "description": "Create src/hooks/useLocation.ts — unified location services. Current location for delivery tracking, geo-fencing for clock-in, address validation for customer orders, zone detection for delivery fee calculation. Permission handling. Battery-efficient tracking for runners. Connected to delivery, POS, and time tracking modules.",
    "passes": false
  },
  {
    "id": "task-385",
    "title": "Create mobile quick actions widget",
    "description": "Create src/components/mobile/QuickActionsWidget.tsx — floating action button on mobile with expandable quick actions. Scan barcode, create order, view notifications, search. Contextual actions based on current page. Customizable per user role. Runner sees delivery actions, admin sees full menu. Connected to usePermissions and role system.",
    "passes": false
  },
  {
    "id": "task-386",
    "title": "Create mobile inter-module navigation",
    "description": "Create src/components/mobile/MobileNav.tsx — bottom navigation bar optimized for mobile. 5 tabs — Dashboard, Orders, Products, Deliveries, More. Badge counts on tabs (pending orders, low stock, active deliveries). Swipe gestures between major sections. Deep linking support — open specific order from notification. Connected to sidebar badges and notification system.",
    "passes": false
  },
  {
    "id": "task-387",
    "title": "Create mobile data usage optimization",
    "description": "Create src/hooks/useDataOptimization.ts — reduce data usage on mobile. Lazy load images. Paginate with smaller page sizes on mobile. Cache aggressively. Reduce realtime subscription frequency. Compress API responses. Detect connection quality and adjust. Connected to all data fetching hooks with mobile-specific overrides.",
    "passes": false
  },
  {
    "id": "task-388",
    "title": "Create mobile app install prompt",
    "description": "Create src/components/mobile/InstallPrompt.tsx — PWA install prompt for mobile users. Detect if not installed. Show banner with install benefits. Defer prompt to appropriate moment (after 2nd visit or after completing action). Track install rate. Connected to PWA configuration. Branded with tenant logo.",
    "passes": false
  },
  {
    "id": "task-389",
    "title": "Create mobile accessibility features",
    "description": "Ensure all mobile views are accessible. Screen reader support with proper ARIA labels. High contrast mode. Font size adjustment. Touch target minimum 44px. Keyboard navigation support for connected keyboards. Voice input for search. Connected to user settings for preferences. WCAG 2.1 AA compliance.",
    "passes": false
  },
  {
    "id": "task-390",
    "title": "Create mobile feedback and support",
    "description": "Create src/components/mobile/FeedbackButton.tsx — in-app feedback and support access on mobile. Bug report with screenshot capture. Feature request form. Help articles search. Contact support action. Feedback linked to current page context and user role. Connected to messaging system for support tickets.",
    "passes": false
  },
  {
    "id": "task-391",
    "title": "Create universal entity link component",
    "description": "Create src/components/admin/shared/EntityLink.tsx — smart link component. Pass entityType and entityId, it renders the entity name as a clickable link. Resolves name from cache or lightweight query. Tooltip shows preview on hover. Opens DetailPanel on click if modifier key held. Used EVERYWHERE any entity is referenced in any module. Single component powering all cross-module linking.",
    "passes": false
  },
  {
    "id": "task-392",
    "title": "Create cascade delete protection",
    "description": "Create src/hooks/useCascadeCheck.ts — before deleting any entity, check for dependent records across modules. Deleting a product? Check for active orders, menu listings, PO items. Deleting a customer? Check for open orders, outstanding balance. Show warning dialog with list of dependencies. Prevent delete if critical dependencies exist. Option to archive instead.",
    "passes": false
  },
  {
    "id": "task-393",
    "title": "Create cross-module data refresh orchestrator",
    "description": "Create src/hooks/useRefreshOrchestrator.ts — when a critical action happens (order created, payment received, stock adjusted), orchestrate query invalidation across ALL affected modules in the correct order. Prevents stale data anywhere. Central place to define which actions invalidate which query keys. Replaces ad-hoc invalidation scattered across modules.",
    "passes": false
  },
  {
    "id": "task-394",
    "title": "Create tenant onboarding completion checker",
    "description": "Create src/hooks/useOnboardingStatus.ts — checks if tenant has completed essential setup across all modules. Has products? Has delivery zones? Has menu? Has payment method configured? Has compliance info? Show progress on dashboard. Nudge to complete missing steps. Each check queries respective module. Guides new tenants to full interconnectivity.",
    "passes": false
  },
  {
    "id": "task-395",
    "title": "Create cross-module duplicate detection",
    "description": "Create src/hooks/useDuplicateDetection.ts — when creating any entity, check for potential duplicates. New customer — check phone/email exists. New product — check SKU/name similarity. New vendor — check name/license match. Show merge suggestion if duplicate found. Prevents data fragmentation. Connected to all creation forms.",
    "passes": false
  },
  {
    "id": "task-396",
    "title": "Create universal audit trail viewer",
    "description": "Enhance activity_log viewer to show audit trail for any entity from any module. On any detail page, show audit tab with full history — who created, who edited what, status changes, related actions (payment on order, delivery on order). Timeline format. Filter by action type. Export audit trail. Universal across all modules.",
    "passes": false
  },
  {
    "id": "task-397",
    "title": "Create system-wide data integrity check",
    "description": "Create Supabase Edge Function data-integrity-check — scheduled function that verifies data consistency. Checks — order totals match sum of items, inventory quantities match history, customer LTV matches order totals, payment totals match order totals, delivery count matches assigned orders. Report emailed to admin. Fix suggestions for discrepancies.",
    "passes": false
  },
  {
    "id": "task-398",
    "title": "Create cross-module bulk action framework",
    "description": "Create src/hooks/useBulkAction.ts — generic bulk action framework used by all data tables. Select items → choose action → confirm → execute with progress → results summary. Actions trigger proper cross-module side effects (bulk order confirm triggers bulk inventory decrement). Error handling for partial failures. Undo support where possible.",
    "passes": false
  },
  {
    "id": "task-399",
    "title": "Create universal entity timeline component",
    "description": "Create src/components/admin/shared/EntityTimeline.tsx — shows complete timeline for any entity type. Aggregates data from activity_log, order events, payment events, delivery events, communications, notes. Each event rendered with icon, description, user, and timestamp. Clickable references to related entities. Used on every detail page.",
    "passes": false
  },
  {
    "id": "task-400",
    "title": "Create admin dashboard personalization",
    "description": "Each admin user can personalize their dashboard. Drag-drop widgets from all modules. Resize widgets. Save layout per user. Quick-switch between role-based presets (manager view, operations view, finance view). Widgets from orders, inventory, deliveries, analytics, customers, payments all available. Connects every module to the central dashboard.",
    "passes": false
  },
  {
    "id": "task-401",
    "title": "Create cross-module report scheduler",
    "description": "Create src/pages/admin/ReportScheduler.tsx — schedule automated reports from any module. Select report type (sales, inventory, delivery, customer, financial). Set schedule (daily/weekly/monthly). Choose format (PDF/CSV). Email recipients. Reports pull data from respective module analytics. History of generated reports. Download past reports.",
    "passes": false
  },
  {
    "id": "task-402",
    "title": "Create tenant migration between environments",
    "description": "Create src/lib/tenantMigration.ts — export entire tenant configuration and data. Useful for migrating between staging and production. Export includes settings, user roles, products, customers, menus, templates, rules. Import to new environment. Validates data integrity on import. Connected to all module data stores.",
    "passes": false
  },
  {
    "id": "task-403",
    "title": "Create cross-module changelog",
    "description": "Create src/pages/admin/Changelog.tsx — show what changed across all modules. New features enabled, settings changed, significant data changes. Admin-generated changelog entries. Automatic entries for major events (100th order, new record day). Helps team stay informed. Connects system events to team communication.",
    "passes": false
  },
  {
    "id": "task-404",
    "title": "Create entity relationship graph visualization",
    "description": "Create src/components/admin/shared/RelationshipGraph.tsx — visual graph showing how an entity connects to others. For an order — shows customer, products, delivery, payment, runner as connected nodes. Interactive — click any node to navigate. Uses d3 force-directed graph or similar. Available on any detail page. Ultimate visualization of interconnectivity.",
    "passes": false
  },
  {
    "id": "task-405",
    "title": "Create admin quick switch between modules",
    "description": "Create src/components/admin/shared/ModuleSwitcher.tsx — Cmd+J opens module switcher. List all modules with keyboard navigation. Recent pages in each module. Jump to any module page in 2 keystrokes. Shows badge counts. Fuzzy search module names. Faster than sidebar navigation. Connected to route system and permissions.",
    "passes": false
  },
  {
    "id": "task-406",
    "title": "Create system-wide error tracking",
    "description": "Create src/lib/errorTracking.ts — capture and aggregate errors from all modules. Error boundary catches in each module report to central tracker. Group errors by module, frequency, and severity. Admin alert for new error patterns. Error dashboard in settings. Helps identify interconnection failures. Connected to module health checker.",
    "passes": false
  },
  {
    "id": "task-407",
    "title": "Create cross-module data migration tools",
    "description": "Create src/pages/admin/DataTools.tsx — admin tools for data management across modules. Merge duplicate records (customers, products). Fix orphaned references. Recalculate derived fields (LTV, stock levels). Repair broken interconnections. Audit and fix mode. Runs with progress tracking. Admin-only access.",
    "passes": false
  },
  {
    "id": "task-408",
    "title": "Create system startup self-test",
    "description": "Create src/hooks/useStartupCheck.ts — when admin panel loads, run quick self-test. Verify Supabase connection, realtime working, auth valid, tenant loaded, critical tables accessible. Show subtle loading indicator during check. Red banner if any check fails. Helps proactively identify issues before they affect operations. Tests core interconnections.",
    "passes": false
  },
  {
    "id": "task-409",
    "title": "Create admin session activity tracking",
    "description": "Create src/hooks/useSessionTracking.ts — track admin user sessions. Pages visited, actions taken, time spent per module, features used. Data helps understand which modules and interconnections are most valuable. Anonymized analytics for product improvement. Session replay capability for debugging. Connected to user management.",
    "passes": false
  },
  {
    "id": "task-410",
    "title": "Create interconnectivity test suite runner",
    "description": "Create src/pages/admin/SystemTests.tsx — admin-accessible test suite that verifies all interconnections are working. One-click runs tests for each module connection. Results displayed in real-time. Pass/fail with details. History of test runs. Schedule automated test runs. The definitive check that the entire interconnected system is healthy. Run after deployments and updates.",
    "passes": false
  }
]